
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>传统行业公司涉足互联网软件开发之我见 | 小黑的技术博客</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="sam hu">
    
    <meta name="baidu-site-verification" content="zBj0BDqjSV" />
    
    <meta name="description" content="&amp;#x4F20;&amp;#x7EDF;&amp;#x884C;&amp;#x4E1A;&amp;#x516C;&amp;#x53F8;&amp;#x6D89;&amp;#x8DB3;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x8F6F;&amp;#x4EF6;&amp;#x5F00;&amp;#x53D1;&amp;#x4E4B;&amp;#x6211;&amp;#x89C1;2016&amp;#x5E74;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD8;&amp;#x6">
<meta property="og:type" content="article">
<meta property="og:title" content="传统行业公司涉足互联网软件开发之我见">
<meta property="og:url" content="http://blog.huguiqi.com/2017/01/18/传统行业公司涉足互联网软件开发之我见/index.html">
<meta property="og:site_name" content="小黑的技术博客">
<meta property="og:description" content="&amp;#x4F20;&amp;#x7EDF;&amp;#x884C;&amp;#x4E1A;&amp;#x516C;&amp;#x53F8;&amp;#x6D89;&amp;#x8DB3;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x8F6F;&amp;#x4EF6;&amp;#x5F00;&amp;#x53D1;&amp;#x4E4B;&amp;#x6211;&amp;#x89C1;2016&amp;#x5E74;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD8;&amp;#x6">
<meta property="og:updated_time" content="2017-02-06T01:37:36.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="传统行业公司涉足互联网软件开发之我见">
<meta name="twitter:description" content="&amp;#x4F20;&amp;#x7EDF;&amp;#x884C;&amp;#x4E1A;&amp;#x516C;&amp;#x53F8;&amp;#x6D89;&amp;#x8DB3;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x8F6F;&amp;#x4EF6;&amp;#x5F00;&amp;#x53D1;&amp;#x4E4B;&amp;#x6211;&amp;#x89C1;2016&amp;#x5E74;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD8;&amp;#x6">
<meta name="twitter:creator" content="@XiaoheiSpring">
<link rel="publisher" href="109318125124422212783">

    
    <link rel="alternative" href="/atom.xml" title="小黑的技术博客" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="小黑的技术博客" title="小黑的技术博客"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="小黑的技术博客">小黑的技术博客</a></h1>
				<h2 class="blog-motto">技术分享与学习，聚沙成塔!</h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/about">关于</a></li>
					
					<li><a href="http://blog.huguiqi.com.">副站</a></li>
					<li>
 					
						<form class="search" action="/search/index.html" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="text" id="search" autocomplete="on" class="st-default-search-input"  name="q" maxlength="30" placeholder="搜索" />
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2017/01/18/传统行业公司涉足互联网软件开发之我见/" title="传统行业公司涉足互联网软件开发之我见" itemprop="url">传统行业公司涉足互联网软件开发之我见</a>
  </h1>
  <p class="article-author">By
       
		<a href="https://plus.google.com/109318125124422212783?rel=author" title="sam hu" target="_blank" itemprop="author">sam hu</a>
		
  <p class="article-time">
    <time datetime="2017-01-18T06:26:11.000Z" itemprop="datePublished"> 发表于 2017-01-18</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#传统行业公司涉足互联网软件开发之我见"><span class="toc-number">1.</span> <span class="toc-text">传统行业公司涉足互联网软件开发之我见</span></a></li></ol>
		
		</div>
		
		<h1 id="&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x516C;&#x53F8;&#x6D89;&#x8DB3;&#x4E92;&#x8054;&#x7F51;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E4B;&#x6211;&#x89C1;"><a href="#&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x516C;&#x53F8;&#x6D89;&#x8DB3;&#x4E92;&#x8054;&#x7F51;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E4B;&#x6211;&#x89C1;" class="headerlink" title="&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x516C;&#x53F8;&#x6D89;&#x8DB3;&#x4E92;&#x8054;&#x7F51;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E4B;&#x6211;&#x89C1;"></a>&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x516C;&#x53F8;&#x6D89;&#x8DB3;&#x4E92;&#x8054;&#x7F51;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E4B;&#x6211;&#x89C1;</h1><p>2016&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x4E09;&#x5929;&#x5C31;&#x8981;&#x56DE;&#x8001;&#x5BB6;&#x8FC7;&#x5E74;&#x4E86;&#xFF1B;&#x8FD9;&#x4E00;&#x5E74;&#x8D70;&#x6765;&#xFF0C;&#x603B;&#x7ED3;&#x4E0B;&#x6765;&#xFF0C;&#x6709;&#x559C;&#x6709;&#x60B2;&#xFF0C;&#x6709;&#x805A;&#x6709;&#x6563;&#xFF1B;<br>&#x751F;&#x6D3B;&#x4E0A;&#xFF0C;&#x7EC8;&#x4E8E;&#x627E;&#x5230;&#x4E86;&#x6211;&#x7684;&#x53E6;&#x4E00;&#x534A;&#xFF0C;&#x56E0;&#x4E3A;&#x5979;&#xFF0C;&#x4ECA;&#x5E74;&#x6211;&#x518D;&#x7D2F;&#xFF0C;&#x5FC3;&#x4E5F;&#x662F;&#x751C;&#x7684;&#x3002;&#x4ECA;&#x5E74;&#x6211;&#x5C06;&#x4F1A;&#x5E26;&#x5979;&#x89C1;&#x6211;&#x7684;&#x7236;&#x6BCD;&#xFF0C;&#x5982;&#x679C;&#x987A;&#x5229;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;17&#x5E74;&#x56FD;&#x5E86;&#x4E3E;&#x884C;&#x5A5A;&#x793C;&#x3002;</p>
<p>&#x6211;&#x7684;&#x516C;&#x53F8;&#x8001;&#x677F;&#xFF0C;&#x6709;&#x4E00;&#x9897;&#x505A;&#x56FD;&#x4EA7;&#x7B2C;&#x4E00;&#x652F;&#x667A;&#x80FD;&#x7535;&#x52A8;&#x7259;&#x5237;&#x7684;&#x5FC3;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x7B2C;&#x4E00;&#x5929;&#x89C1;&#x4ED6;&#x65F6;&#xFF0C;&#x4ECE;&#x4ED6;&#x8EAB;&#x4E0A;&#x5C31;&#x900F;&#x9732;&#x7740;&#x4E00;&#x8EAB;&#x6C5F;&#x6E56;&#x8349;&#x83BD;&#x4E49;&#x6C14;&#xFF0C;&#x5F53;&#x65F6;&#x89C9;&#x5F97;&#xFF0C;&#x8BB2;&#x4E49;&#x6C14;&#x7684;&#x4EBA;&#xFF0C;&#x4EBA;&#x54C1;&#x4E0D;&#x4F1A;&#x592A;&#x5DEE;&#xFF0C;&#x8001;&#x677F;&#x7684;&#x8BDD;&#x66F4;&#x4E0D;&#x4F1A;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#xFF0C;&#x6211;&#x4E5F;&#x89C9;&#x5F97;&#x633B;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x4E5F;&#x60F3;&#x505A;&#x505A;&#x8FD9;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x7B54;&#x5E94;&#x5EFA;&#x7ACB;&#x56E2;&#x961F;&#xFF0C;&#x7ED9;&#x4ED6;&#x505A;&#x51FA;&#x4E2A;&#x50CF;&#x6837;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;<br>&#x4F46;&#x4E00;&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x53CC;&#x5341;&#x4E00;&#x7684;app&#x7248;&#x672C;&#xFF0C;&#x8BF4;&#x53E5;&#x5FC3;&#x91CC;&#x8BDD;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x90FD;&#x975E;&#x5E38;&#x4E0D;&#x6EE1;&#x610F;&#x7684;&#xFF1B;<br>&#x9996;&#x5148;&#xFF0C;app&#x7684;&#x4F7F;&#x7528;&#x5E76;&#x4E0D;&#x6D41;&#x7545;&#xFF0C;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x7528;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x641E;&#x9519;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;&#x4E8C;&#x7EF4;&#x7801;&#x626B;&#x63CF;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x667A;&#x80FD;&#x975E;&#x667A;&#x80FD;&#x7528;&#x6237;&#x5B8C;&#x5168;&#x641E;&#x4E0D;&#x6E05;&#x695A;&#xFF1B;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x5F88;&#x591A;&#x7528;&#x6237;&#x8054;&#x7CFB;&#x6295;&#x8BC9;&#xFF1B;<br>&#x4F46;&#x662F;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E00;&#x5E74;&#x4E0E;&#x676D;&#x5DDE;&#x7684;&#x6C9F;&#x901A;&#x4EA4;&#x6D41;&#x4E2D;&#x79CD;&#x79CD;&#x7684;&#x4E0D;&#x7545;&#xFF0C;&#x8BA9;&#x6211;&#x5F7B;&#x5E95;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x51FA;&#x73B0;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x628A;&#x539F;&#x56E0;&#x7B80;&#x5355;&#x7684;&#x5F52;&#x548E;&#x4E8E;&#x8FD0;&#x8425;/&#x4EA7;&#x54C1;&#x3001;&#x8F6F;&#x4EF6;&#x3001;&#x786C;&#x4EF6;&#x5206;&#x5C5E;&#x4E09;&#x5730;&#xFF0C;&#x5BFC;&#x81F4;&#x6C9F;&#x901A;&#x4E0D;&#x7545;&#xFF1B;<br>&#x6211;&#x603B;&#x7ED3;&#x4E0B;&#x6765;&#x4E3B;&#x8981;&#x6709;&#x8FD9;&#x51E0;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x8FD0;&#x8425;&#x4E0E;&#x4EA7;&#x54C1;&#x4FE1;&#x606F;&#x66F4;&#x65B0;&#x4E0D;&#x53CA;&#x65F6;&#xFF1B;<em> </em> &#x4EA7;&#x54C1;&#x5BF9;&#x6280;&#x672F;&#x4FE1;&#x606F;&#x66DD;&#x5149;&#x4E0D;&#x53CA;&#x65F6;&#xFF1B;</li>
<li>&#x786C;&#x4EF6;&#x65B9;&#x9762;&#x95EE;&#x9898;&#x5168;&#x90E8;&#x90FD;&#x4F53;&#x73B0;&#x5728;&#x8F6F;&#x4EF6;&#x4E0A;&#xFF0C;&#x7528;&#x6237;&#x53EA;&#x80FD;&#x53BB;&#x602A;&#x8F6F;&#x4EF6;&#xFF0C;&#x5DEE;&#x8BC4;&#x53EA;&#x4F1A;&#x8BF4;&#x8F6F;&#x4EF6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5165;&#x53E3;&#x5C31;&#x662F;&#x8F6F;&#x4EF6;</li>
<li>&#x4E0D;&#x4E13;&#x4E1A;&#x56E2;&#x961F;&#x6307;&#x6325;&#x6280;&#x672F;&#x56E2;&#x961F;&#xFF1B;</li>
<li>&#x6280;&#x672F;&#x56E2;&#x961F;&#x521D;&#x671F;&#x62DB;&#x4EBA;&#x4E0D;&#x614E;&#xFF0C;&#x5BFC;&#x81F4;&#x4EE3;&#x7801;&#x8D85;&#x96BE;&#x7EF4;&#x62A4;&#xFF1B;</li>
<li>&#x4EA7;&#x54C1;&#x539F;&#x578B;&#x7684;&#x7F3A;&#x5931;&#x4E0E;&#x9700;&#x6C42;&#x4E0D;&#x6E05;&#x6670;&#x5BFC;&#x81F4;&#x8BBE;&#x8BA1;&#x6F0F;&#x6D1E;&#x592A;&#x591A;;</li>
</ul>
<a id="more"></a>
<p>&#x516C;&#x53F8;&#x8FD0;&#x8425;&#x56E2;&#x961F;&#x5728;app&#x624D;&#x521A;&#x9762;&#x4E16;&#x4E0D;&#x4E45;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x5B8C;&#x5584;&#x65F6;&#xFF0C;&#x5C31;&#x5728;10&#x6708;&#x4E2D;&#x65EC;&#x575A;&#x51B3;&#x8981;&#x6C42;&#x52A0;&#x5165;&#x793E;&#x4EA4;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x975E;&#x5E38;&#x9192;&#x76EE;&#x7684;&#x9996;&#x9875;&#x4EE5;&#x53D1;&#x5E16;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x8FD9;&#x5C31;&#x5DF2;&#x7ECF;&#x57CB;&#x4E0B;&#x4E86;&#x4E00;&#x9897;&#x7528;&#x6237;&#x5DEE;&#x8BC4;&#x6548;&#x5E94;&#x7684;&#x5B9A;&#x65F6;&#x70B8;&#x5F39;&#x3002;<br>&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x5728;&#x529F;&#x80FD;&#x8FD8;&#x4E0D;&#x5B8C;&#x5584;&#xFF0C;&#x4E0D;&#x7A33;&#x5B9A;&#x65F6;&#xFF0C;&#x5F3A;&#x884C;&#x5C06;&#x8F6F;&#x4EF6;&#x5927;&#x89C4;&#x6A21;&#x63A8;&#x5E7F;&#xFF0C;&#x65E0;&#x89C6;&#x6280;&#x672F;&#x56E2;&#x961F;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x5728;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x90FD;&#x4E0D;&#x5B8C;&#x5584;&#x60C5;&#x51B5;&#x4E0B;&#x589E;&#x52A0;&#x6D3B;&#x52A8;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x53EA;&#x80FD;&#x5BF9;&#x516C;&#x53F8;&#x54C1;&#x724C;&#x9020;&#x6210;&#x4E0D;&#x597D;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x4ECE;&#x5C0F;&#x505A;&#x5230;&#x5927;&#x5176;&#x5B9E;&#x662F;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x8001;&#x677F;&#x662F;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x51FA;&#x8EAB;&#xFF0C;&#x4EE5;&#x524D;&#x662F;&#x4ECE;&#x5C0F;&#x516C;&#x53F8;&#x5E72;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x505A;&#x8FC7;&#x76AE;&#x5177;&#x3001;&#x76AE;&#x5305;&#xFF0C;&#x4E5F;&#x505A;&#x8FC7;&#x62C9;&#x6746;&#x7BB1;&#xFF0C;&#x540E;&#x6765;&#x624D;&#x5F00;&#x59CB;&#x505A;&#x7535;&#x52A8;&#x7259;&#x5237;&#xFF0C;&#x5982;&#x4ECA;&#xFF0C;&#x7535;&#x52A8;&#x7259;&#x5237;&#x5728;&#x56FD;&#x5185;&#x54C1;&#x724C;&#x4E2D;&#x7684;&#x9500;&#x91CF;&#x8FD8;&#x662F;NO.1&#x7684;&#x5730;&#x4F4D;&#xFF1B;&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x540C;&#x7B49;&#x884C;&#x4E1A;&#x7684;&#x7535;&#x52A8;&#x7259;&#x5237;&#x54C1;&#x724C;&#xFF0C;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#x8FD8;&#x6709;&#x592A;&#x591A;&#x5730;&#x65B9;&#x9700;&#x8981;&#x5B66;&#x4E60;&#xFF0C;&#x6210;&#x957F;&#xFF1B;&#x4F46;&#x662F;&#xFF0C;&#x4F18;&#x5148;&#x8FC8;&#x51FA;&#x56FD;&#x4EA7;&#x667A;&#x80FD;&#x7259;&#x5237;&#x5E73;&#x53F0;&#x8FD9;&#x4E00;&#x6B65;&#x7684;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x5F88;&#x6B23;&#x8D4F;&#xFF0C;&#x4E5F;&#x4F1A;&#x4F69;&#x670D;&#x7684;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E00;&#x70B9;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#x662F;&#x5148;&#x4E8E;&#x5176;&#x5B83;&#x516C;&#x53F8;&#x7684;&#xFF0C;&#x4F46;&#x4ECE;&#x6548;&#x679C;&#x4E0A;&#x6765;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x4E0D;&#x660E;&#x786E;&#xFF0C;&#x4EA7;&#x54C1;&#x3001;&#x8FD0;&#x8425;&#x3001;&#x8F6F;&#x4EF6;&#x3001;&#x786C;&#x4EF6;&#x5404;&#x81EA;&#x4E3A;&#x6218;&#xFF0C;&#x6E34;&#x671B;&#x6210;&#x529F;&#x7684;&#x8001;&#x677F;&#x601D;&#x7EF4;&#x53C8;&#x975E;&#x5E38;&#x6D3B;&#x8DC3;&#xFF0C;&#x65F6;&#x4E0D;&#x65F6;&#x7684;&#x5934;&#x8111;&#x98CE;&#x66B4;&#x8BA9;&#x672C;&#x6765;&#x5C31;&#x76EE;&#x6807;&#x4E0D;&#x7EDF;&#x4E00;&#x7684;&#x6218;&#x7EBF;&#x66F4;&#x52A0;&#x6DF7;&#x4E71;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;2016&#x5E74;&#x968F;&#x4FBF;&#x95EE;&#x4E0B;&#x516C;&#x53F8;&#x5185;&#x4E3B;&#x7BA1;&#x7EA7;&#x7684;&#x5458;&#x5DE5;&#xFF0C;&#x95EE;&#x4ED6;&#x4EEC;&#xFF0C;2016&#x5E74;&#x7684;&#x516C;&#x53F8;&#x5E74;&#x5EA6;&#x76EE;&#x6807;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x6CA1;&#x4EBA;&#x53EF;&#x4EE5;&#x56DE;&#x7B54;&#xFF01;&#x6211;&#x60F3;&#xFF0C;&#x8001;&#x677F;&#x81EA;&#x5DF1;&#x4E5F;&#x8BB8;&#x90FD;&#x6CA1;&#x6709;&#x7B54;&#x6848;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x8001;&#x677F;&#x80FD;&#x628A;&#x516C;&#x53F8;&#x505A;&#x5230;&#x73B0;&#x5728;&#x8FD9;&#x4E48;&#x5927;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x5F88;&#x4F69;&#x670D;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x8001;&#x677F;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#x8FD8;&#x662F;&#x6309;&#x7167;&#x505A;&#x5C0F;&#x56E2;&#x961F;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x7BA1;&#x7406;&#x76EE;&#x524D;&#x5206;&#x6563;&#x7684;&#x516C;&#x53F8;&#x7EC4;&#x7EC7;&#x67B6;&#x6784;&#xFF0C;&#x6211;&#x60F3;&#x5C31;&#x662F;&#x975E;&#x5E38;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF1B;&#x518D;&#x52A0;&#x4E0A;&#x8FC7;&#x5206;&#x4F9D;&#x8D56;&#x8001;&#x73ED;&#x5B50;&#xFF0C;&#x8BA9;&#x5212;&#x5C0F;&#x821F;&#x7684;&#x6307;&#x6325;&#x5F00;&#x5766;&#x514B;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x5BF9;&#x5F00;&#x5766;&#x514B;&#x7684;&#x4E0D;&#x4FE1;&#x4EFB;&#xFF0C;&#x8FD9;&#x6837;&#x81EA;&#x7136;&#x4F1A;&#x51FA;&#x73B0;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x540E;&#x53EA;&#x80FD;&#x8BF4;&#xFF0C;&#x5766;&#x514B;&#x4E0D;&#x5728;&#x6C34;&#x91CC;&#xFF0C;&#x4E0D;&#x597D;&#x63A7;&#x5236;&#xFF0C;&#x5EFA;&#x8BAE;&#x5F00;&#x5766;&#x514B;&#x7684;&#x628A;&#x9635;&#x5730;&#x79FB;&#x5230;&#x6C99;&#x6EE9;&#x4E0A;&#xFF0C;&#x597D;&#x5427;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;<br>&#x54C1;&#x724C;&#x8981;&#x5EFA;&#x7ACB;&#x8D77;&#x6765;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x4E00;&#x671D;&#x4E00;&#x5915;&#x7684;&#xFF0C;&#x54B1;&#x4EEC;&#x516C;&#x53F8;&#x7684;&#x7259;&#x5237;&#x54C1;&#x724C;&#xFF0C;&#x505A;&#x4E86;14&#x5E74;&#x624D;&#x505A;&#x5230;&#x73B0;&#x5728;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x5B9E;&#x4F53;&#x4EA7;&#x54C1;&#x5B83;&#x662F;&#x4EA7;&#x54C1;&#xFF0C;&#x867D;&#x7136;&#x76EE;&#x524D;&#x8F6F;&#x4EF6;&#x662F;&#x8F85;&#x52A9;&#x5B9E;&#x4F53;&#x4EA7;&#x54C1;&#x63D0;&#x5347;&#x4EA7;&#x54C1;&#x5185;&#x6DB5;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x4E25;&#x683C;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x4E5F;&#x662F;&#x4EA7;&#x54C1;&#xFF0C;&#x4ED6;&#x662F;&#x667A;&#x80FD;&#x786C;&#x4EF6;&#x4E0E;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x7684;&#x6865;&#x6881;&#xFF0C;&#x6865;&#x4E0D;&#x597D;&#x7528;&#xFF0C;&#x56FA;&#x7136;&#x9020;&#x6865;&#x7684;&#x4EBA;&#x6709;&#x8D23;&#x4EFB;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8BF4;&#x9020;&#x6865;&#x7528;&#x7684;&#x94A2;&#x7B4B;&#x6C34;&#x6CE5;&#x4E0D;&#x597D;&#x7528;&#x5462;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x6865;&#x7684;&#x8BBE;&#x8BA1;&#x6709;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x8BF4;&#x8FC7;&#x6865;&#x7684;&#x4EBA;&#x4E0A;&#x6865;&#x5F88;&#x5403;&#x529B;&#xFF0C;&#x8BF4;&#x6865;&#x4E0D;&#x4EBA;&#x6027;&#x5462;&#xFF1F;&#x8FD9;&#x4E9B;&#x5C31;&#x662F;&#x9700;&#x6C42;&#x4E0D;&#x5230;&#x4F4D;&#x4E86;&#xFF0C;&#x6CA1;&#x95EE;&#x8FC7;&#x771F;&#x6B63;&#x8FC7;&#x6865;&#x7684;&#x4EBA;&#x662F;&#x600E;&#x4E48;&#x60F3;&#x7684;&#xFF0C;&#x505A;&#x65B9;&#x6848;&#x7684;&#x662F;&#x4E00;&#x4E9B;&#x5750;&#x8F7F;&#x5B50;&#x7684;&#xFF0C;&#x786C;&#x8BF4;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x8FC7;&#x6865;&#x7684;&#xFF0C;&#x8FD9;&#x505A;&#x51FA;&#x6765;&#x7684;&#x9700;&#x8981;&#x65B9;&#x6848;&#x80FD;&#x662F;&#x5BF9;&#x7684;&#x5417;&#xFF1F;&#x505A;&#x9700;&#x6C42;&#x5982;&#x679C;&#x54B1;&#x4EEC;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x4E86;&#x89E3;&#x51B3;&#x5230;&#x6700;&#x6DF1;&#x5904;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x505A;&#x6700;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x60F3;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x8981;&#x53BB;&#x60F3;&#x90A3;&#x4E9B;&#x5F88;&#x96BE;&#x5B9E;&#x73B0;&#xFF0C;&#x5374;&#x94BB;&#x7740;&#x5C16;&#x60F3;&#x8BA9;&#x4EBA;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5F80;&#x5F80;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5E76;&#x4E0D;&#x662F;&#x8FC7;&#x6865;&#x4EBA;&#x5728;&#x610F;&#x7684;&#xFF0C;&#x8FC7;&#x6865;&#x4EBA;&#x5728;&#x610F;&#x7684;&#x662F;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x7684;&#x8FC7;&#x6865;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x5BF9;&#x4E8E;&#x4F60;&#x6865;&#x4E0A;&#x6709;&#x6CA1;&#x6709;&#x4EBA;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x5C0F;&#x5356;&#x90E8;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x5C0F;&#x5546;&#x8D29;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FC7;&#x6865;&#x4EBA;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x5341;&#x5206;&#x5728;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E3A;&#x4E86;&#x523B;&#x610F;&#x8FFD;&#x6C42;&#x8FD9;&#x4E9B;&#xFF0C;&#x628A;&#x6865;&#x5F04;&#x5F97;&#x8DDF;&#x96C6;&#x5E02;&#x4E00;&#x6837;&#xFF0C;&#x8FC7;&#x6865;&#x7684;&#x4EBA;&#x4E0D;&#x65B9;&#x4FBF;&#x4E86;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x662F;&#x80CC;&#x79BB;&#x4E86;&#x9700;&#x6C42;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p><strong>&#x63A5;&#x4E0A;&#x6BB5;&#xFF1A;</strong></p>
<ul>
<li>2017-02-03 &#x4E0B;&#x5348;3&#x70B9;<br>&#x4ECA;&#x5929;&#x662F;&#x5E74;&#x540E;&#x4E0A;&#x73ED;&#x7B2C;&#x4E00;&#x5929;&#xFF0C;&#x6280;&#x672F;&#x90E8;&#x7684;&#x4EBA;&#x90FD;&#x88AB;&#x6211;&#x6697;&#x793A;&#x7740;&#x8BF7;&#x5047;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5E74;&#x524D;&#x8001;&#x677F;&#x8BF4;&#x56E0;&#x4E3A;&#x6280;&#x672F;&#x90E8;&#x7684;&#x539F;&#x56E0;&#x9020;&#x6210;&#x53CC;&#x5341;&#x4E00;&#x5F88;&#x5927;&#x7684;&#x635F;&#x5931;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5C06;&#x4E0A;&#x6D77;&#x6280;&#x672F;&#x90E8;&#x5F3A;&#x5236;&#x8F6C;&#x79FB;&#x5230;&#x676D;&#x5DDE;&#xFF0C;&#x540E;&#x6765;&#x53C8;&#x8BF4;&#x9519;&#x602A;&#x4E86;&#x6211;&#x4EEC;&#xFF0C;&#x6280;&#x672F;&#x90E8;&#x8FD8;&#x662F;&#x5728;&#x4E0A;&#x6D77;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x8BA9;&#x6211;&#x5F88;&#x96BE;&#x8FC7;&#xFF0C;&#x8FD9;&#x8BA9;&#x6574;&#x4E2A;&#x4E0A;&#x6D77;&#x516C;&#x53F8;&#x7684;&#x540C;&#x4E8B;&#xFF0C;&#x5305;&#x62EC;&#x4EBA;&#x4E8B;&#x7ECF;&#x7406;&#xFF0C;&#x884C;&#x653F;&#x4E3B;&#x7BA1;&#xFF0C;&#x9500;&#x552E;&#x603B;&#x76D1;&#x90FD;&#x5F88;&#x5403;&#x60CA;&#xFF0C;&#x5E76;&#x4E3A;&#x6280;&#x672F;&#x90E8;&#x6253;&#x62B1;&#x4E0D;&#x5E73;&#xFF0C;&#x4E0A;&#x6D77;&#x6280;&#x672F;&#x90E8;&#x95E8;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x6709;&#x76EE;&#x5171;&#x7779;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x660E;&#x663E;&#x4E0D;&#x5BF9;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6280;&#x672F;&#x90E8;&#x4E5F;&#x4E0D;&#x6B62;&#x4E00;&#x6B21;&#x63D0;&#x9192;&#x8FC7;&#xFF0C;&#x4F46;&#x662F;&#x5F97;&#x5230;&#x7684;&#x5374;&#x662F;&#x65E0;&#x89C6;&#xFF0C;&#x800C;&#x5F53;&#x6309;&#x7167;&#x4ED6;&#x4EEC;&#x7684;&#x8981;&#x6C42;&#x505A;&#x5B8C;&#x5BA1;&#x8FC7;&#xFF0C;&#x6D4B;&#x8BD5;&#x4E0A;&#x7EBF;&#x540E;&#xFF0C;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x4EA7;&#x54C1;&#x65F6;&#xFF0C;&#x6295;&#x8BC9;&#x4E86;&#xFF0C;&#x9700;&#x6C42;&#x65B9;&#x5374;&#x4E0D;&#x627F;&#x8BA4;&#x90A3;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5374;&#x8BF4;&#x662F;&#x6280;&#x672F;&#x90E8;&#x6CA1;&#x6309;&#x9700;&#x6C42;&#x505A;&#xFF0C;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x65E0;&#x8D56;&#x626F;&#x76AE;&#x4E8B;&#x4EF6;&#x540E;&#xFF0C;&#x6211;&#x4E0D;&#x60DC;&#x5F97;&#x7F6A;&#x676D;&#x5DDE;&#x6700;&#x5F3A;&#x786C;&#x7684;&#x8FD0;&#x8425;&#x603B;&#x76D1;&#xFF0C;&#x8981;&#x6C42;&#x6240;&#x6709;&#x9700;&#x6C42;&#x5FC5;&#x987B;&#x8FC7;&#x5BA1;&#x540E;&#x53D1;&#x90AE;&#x4EF6;&#x7ED9;&#x6280;&#x672F;&#x90E8;&#x95E8;&#x786E;&#x8BA4;&#xFF0C;&#x6280;&#x672F;&#x90E8;&#x95E8;&#x624D;&#x80FD;&#x5F00;&#x59CB;&#x505A;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x4E8E;&#x65B0;&#x589E;&#x9700;&#x6C42;&#x5185;&#x5BB9;&#xFF0C;&#x6280;&#x672F;&#x90E8;&#x8BA4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x529F;&#x80FD;&#x9700;&#x8981;&#x6709;&#x539F;&#x578B;&#xFF0C;&#x5426;&#x5219;&#x6709;&#x6743;&#x4E0D;&#x505A;&#x3002;<br>&#x800C;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#x4E00;&#x76F4;&#x90FD;&#x6309;&#x7167;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x5C55;&#x5F00;&#xFF0C;&#x5BFC;&#x81F4;&#x676D;&#x5DDE;&#x8BF4;&#x6211;&#x9488;&#x5BF9;&#x4ED6;&#x505A;&#x4E86;&#x8FD9;&#x4E2A;&#x9650;&#x5236;&#xFF0C;&#x4E0D;&#x914D;&#x5408;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x88AB;&#x89E3;&#x6563;&#x7684;&#x540E;&#x679C;&#xFF0C;&#x6211;&#x4ECE;&#x59CB;&#x81F3;&#x7EC8;&#x90FD;&#x6CA1;&#x6709;&#x540E;&#x6094;&#xFF0C;&#x56E0;&#x4E3A;&#x4E3A;&#x8FD9;&#x6837;&#x7684;&#x516C;&#x53F8;&#x5356;&#x547D;&#xFF0C;&#x5B9E;&#x5728;&#x4E0D;&#x503C;&#x5F97;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x53EA;&#x6709;&#x4ED8;&#x51FA;&#xFF0C;&#x6CA1;&#x6709;&#x6210;&#x957F;&#x3002;</li>
</ul>
<p>&#x660E;&#x5929;&#x521D;&#x516B;&#xFF0C;&#x8001;&#x677F;&#x8981;&#x6C42;&#x6211;&#x53BB;&#x676D;&#x5DDE;&#x548C;&#x4ED6;&#x4EEC;&#x8C08;&#x8C08;&#x4ECA;&#x5E74;&#x7684;&#x5DE5;&#x4F5C;&#x5206;&#x914D;&#x4E0E;&#x65B9;&#x5411;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5982;&#x679C;&#x8981;&#x6211;&#x7EE7;&#x7EED;&#x7ED9;&#x8001;&#x677F;&#x5E72;&#x4E0B;&#x53BB;&#xFF0C;&#x9700;&#x8981;&#x660E;&#x786E;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#xFF1F;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x90A3;&#x8C01;&#x6700;&#x9002;&#x5408;&#x5BF9;&#x63A5;&#x4E0E;&#x5206;&#x6790;&#x9700;&#x6C42;&#xFF0C;&#x5C06;&#x9700;&#x6C42;&#x6574;&#x7406;&#x4E0E;&#x8F6C;&#x5316;&#x4E3A;&#x6280;&#x672F;&#x80FD;&#x542C;&#x61C2;&#x7684;&#x8BED;&#x8A00;&#xFF1F;</li>
<li>2017&#x5E74;&#x7684;&#x5E74;&#x5EA6;&#x76EE;&#x6807;&#x662F;&#x4EC0;&#x4E48; &#xFF1F;</li>
<li>&#x786C;&#x4EF6;&#x84DD;&#x7259;&#x7A33;&#x5B9A;&#x6027;&#x9700;&#x8981;&#x63D0;&#x9AD8;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x9488;&#x5BF9;&#x82F9;&#x679C;&#x624B;&#x673A;&#x7684;&#x7A33;&#x5B9A;&#x6027;</li>
</ol>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/杂谈/">杂谈</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/随笔/">随笔</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	  <div data-url="http://blog.huguiqi.com/2017/01/18/传统行业公司涉足互联网软件开发之我见/" data-title="传统行业公司涉足互联网软件开发之我见 | 小黑的技术博客" data-tsina="1601653200" class="share clearfix">
	  </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 

<div class="next">
<a href="/2016/12/28/统计代码工具/"  title="统计代码工具">
 <strong>下一篇：</strong><br/> 
 <span>统计代码工具
</span>
</a>
</div>

</nav>

	
<section id="comments" class="comment">
	<div class="ds-thread" data-thread-key="2017/01/18/传统行业公司涉足互联网软件开发之我见/" data-title="传统行业公司涉足互联网软件开发之我见" data-url="http://blog.huguiqi.com/2017/01/18/传统行业公司涉足互联网软件开发之我见/"></div>
</section>


<section id="comments" class="comment">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>

</div>  
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#传统行业公司涉足互联网软件开发之我见"><span class="toc-number">1.</span> <span class="toc-text">传统行业公司涉足互联网软件开发之我见</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="github-card">
<p class="asidetitle">Github 名片</p>
<div class="github-card" data-github="huguiqi" data-width="220" data-height="119" data-theme="medium">
<script type="text/javascript" src="//cdn.jsdelivr.net/github-cards/latest/widget.js" ></script>
</div>
  </div>



  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/Alcatraz/" title="Alcatraz">Alcatraz<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/docker/" title="docker">docker<sup>4</sup></a></li>
		  
		
		  
			<li><a href="/categories/git/" title="git">git<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/github-博客/" title="github 博客">github 博客<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/ios-Developer/" title="ios Developer">ios Developer<sup>5</sup></a></li>
		  
		
		  
			<li><a href="/categories/javascript/" title="javascript">javascript<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/nodejs/" title="nodejs">nodejs<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/专业技术-印象笔记/" title="专业技术(印象笔记)">专业技术(印象笔记)<sup>222</sup></a></li>
		  
		
		  
			<li><a href="/categories/杂谈/" title="杂谈">杂谈<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/站内搜索-博客/" title="站内搜索 博客">站内搜索 博客<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/管理/" title="管理">管理<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/系统-工具/" title="系统&amp;工具">系统&amp;工具<sup>6</sup></a></li>
		  
		
		  
			<li><a href="/categories/系统-运维/" title="系统&amp;运维">系统&amp;运维<sup>11</sup></a></li>
		  
		
		  
			<li><a href="/categories/网络配置/" title="网络配置">网络配置<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>4</sup></a></li>
		  
		
		  
			<li><a href="/categories/面试题/" title="面试题">面试题<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/从印象笔记导入/" title="从印象笔记导入">从印象笔记导入<sup>222</sup></a></li>
			
		
			
				<li><a href="/tags/ios-developer-upload/" title="ios developer upload">ios developer upload<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/docker-国内镜像/" title="docker 国内镜像">docker 国内镜像<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/javascript-原型编程/" title="javascript&amp;原型编程">javascript&amp;原型编程<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/docker实践-docker教程/" title="docker实践 docker教程">docker实践 docker教程<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/ios-developer-证书过期/" title="ios developer 证书过期">ios developer 证书过期<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/ios-developer-上传审核/" title="ios developer 上传审核">ios developer 上传审核<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/3DTouch-sample/" title="3DTouch sample">3DTouch sample<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/docker升级/" title="docker升级">docker升级<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/macbook显卡门/" title="macbook显卡门">macbook显卡门<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/安装svn/" title="安装svn">安装svn<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitlabe-ce/" title="gitlabe-ce">gitlabe-ce<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/面试题-全栈/" title="面试题 全栈">面试题 全栈<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/iptables与docker的作死碰撞/" title="iptables与docker的作死碰撞">iptables与docker的作死碰撞<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/nginx/" title="nginx">nginx<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/express-异常处理/" title="express 异常处理">express 异常处理<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/oh-my-zsh-vim-macos/" title="oh-my-zsh vim macos">oh-my-zsh vim macos<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/PM2/" title="PM2">PM2<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/svn与git/" title="svn与git">svn与git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/三体/" title="三体">三体<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://godeggs.cn " target="_blank" title="承接手机app、微信、web开发">找人做软件</a>
            
          </li>
        
          <li>
            
            	<a href="http://blog.huguiqi.com." target="_blank" title="sam&#39;s Blog">sam&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  

<div class="doubanshow">
<p class="asidetitle">豆瓣秀</p>
<div>
<script type="text/javascript" src="http://www.douban.com/service/badge/64698454/?show=collection&amp;n=12&amp;columns=3&amp;hidelogo=yes&amp;hideself=yes&amp;cat=book|movie" ></script>
</div>
</div>


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

  <div class="weiboshow">
  <p class="asidetitle">新浪微博</p>
    <iframe width="100%" height="119" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=119&fansRow=2&ptype=1&speed=0&skin=9&isTitle=1&noborder=1&isWeibo=0&isFans=0&uid=1601653200&verifier=bd864c6a&dpc=1"></iframe>
</div>


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Sam.This is my Blog. <br/>
			Anything that can go wrong will go wrong</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/1601653200" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/huguiqi" target="_blank" class="icon-github" title="github"></a>
		
		
		
		<a href="https://twitter.com/XiaoheiSpring" target="_blank" class="icon-twitter" title="twitter"></a>
		
		
		<a href="https://www.facebook.com/sam.hu.7334" target="_blank" class="icon-facebook" title="facebook"></a>
		
		
		<a href="https://www.linkedin.com/in/小黑-胡-ab83b992" target="_blank" class="icon-linkedin" title="linkedin"></a>
		
		
		<a href="https://www.douban.com/people/64698454" target="_blank" class="icon-douban" title="豆瓣"></a>
		
		
		<a href="http://www.zhihu.com/people/hu-xiao-hei-53" target="_blank" class="icon-zhihu" title="知乎"></a>
		
		
		<a href="https://plus.google.com/109318125124422212783?rel=author" target="_blank" class="icon-google_plus" title="Google+"></a>
		
		
		<a href="mailto:guiqi.hu@163.com" target="_blank" class="icon-email" title="Email Me"></a>
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="http://blog.huguiqi.com." target="_blank" title="sam">sam</a> © 2017 
		
		<a href="/about" target="_blank" title="sam hu">sam hu</a>
		
		
		</p>
</div>

 <script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
  (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
  e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');
  
  _st('install','qtnHgvQyg5N9h4en-9wA','2.0.0');
</script>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina'),
      description = $this.attr('description');
  var html = [
  '<div class="hoverqrcode clearfix"></div>',
  '<a class="overlay" id="qrcode"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="微信"></a>',
  '<a href="http://widget.renren.com/dialog/share?resourceUrl=' + encodedUrl + '&srcUrl=' + encodedUrl + '&title=' + title +'" class="article-share-renren" target="_blank" title="人人"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="微博"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);

  $('.hoverqrcode').hide();

  var myWidth = 0;
  function updatehoverqrcode(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
    var qrsize = myWidth > 1024 ? 200:100;
    var options = {render: 'image', size: qrsize, fill: '#2ca6cb', text: url, radius: 0.5, quiet: 1};
    var p = $('.article-share-qrcode').position();
    $('.hoverqrcode').empty().css('width', qrsize).css('height', qrsize)
                          .css('left', p.left-qrsize/2+20).css('top', p.top-qrsize-10)
                          .qrcode(options);
  };
  $(window).resize(function(){
    $('.hoverqrcode').hide();
  });
  $('.article-share-qrcode').click(function(){
    updatehoverqrcode();
    $('.hoverqrcode').toggle();
  });
  $('.article-share-qrcode').hover(function(){}, function(){
      $('.hoverqrcode').hide();
  });
});   
</script>



<script type="text/javascript">
  var duoshuoQuery = {short_name:"小黑_spring"};
  (function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0] 
    || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
</script> 


<script type="text/javascript">

var disqus_shortname = 'huguiqicom';

(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
</script>






<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->



<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?f5971877c7b77f98074be3ddabf34fbe";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>



<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
