
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>什么是SQL注入式攻击？ | 小黑的技术博客</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="sam hu">
    
    <meta name="baidu-site-verification" content="zBj0BDqjSV" />
    
    <meta name="description" content="&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;SQL&amp;#x6CE8;&amp;#x5165;&amp;#x5F0F;&amp;#x653B;&amp;#x51FB;&amp;#xFF1F;&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;SQL&amp;#x6CE8;&amp;#x5165;&amp;#x5F0F;&amp;#x653B;&amp;#x51FB;&amp;#xFF1F;\&amp;#x6240;&amp;#x8C13;SQL&amp;#x6CE8;&amp;#x5165;&amp;#x5F0F;&amp;#x653">
<meta property="og:type" content="article">
<meta property="og:title" content="什么是SQL注入式攻击？">
<meta property="og:url" content="http://blog.huguiqi.com/2016/03/30/什么是SQL注入式攻击？/index.html">
<meta property="og:site_name" content="小黑的技术博客">
<meta property="og:description" content="&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;SQL&amp;#x6CE8;&amp;#x5165;&amp;#x5F0F;&amp;#x653B;&amp;#x51FB;&amp;#xFF1F;&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;SQL&amp;#x6CE8;&amp;#x5165;&amp;#x5F0F;&amp;#x653B;&amp;#x51FB;&amp;#xFF1F;\&amp;#x6240;&amp;#x8C13;SQL&amp;#x6CE8;&amp;#x5165;&amp;#x5F0F;&amp;#x653">
<meta property="og:updated_time" content="2016-03-30T09:08:53.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="什么是SQL注入式攻击？">
<meta name="twitter:description" content="&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;SQL&amp;#x6CE8;&amp;#x5165;&amp;#x5F0F;&amp;#x653B;&amp;#x51FB;&amp;#xFF1F;&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;SQL&amp;#x6CE8;&amp;#x5165;&amp;#x5F0F;&amp;#x653B;&amp;#x51FB;&amp;#xFF1F;\&amp;#x6240;&amp;#x8C13;SQL&amp;#x6CE8;&amp;#x5165;&amp;#x5F0F;&amp;#x653">
<meta name="twitter:creator" content="@XiaoheiSpring">
<link rel="publisher" href="109318125124422212783">

    
    <link rel="alternative" href="/atom.xml" title="小黑的技术博客" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="小黑的技术博客" title="小黑的技术博客"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="小黑的技术博客">小黑的技术博客</a></h1>
				<h2 class="blog-motto">技术分享与学习，聚沙成塔!</h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/about">关于</a></li>
					
					<li><a href="http://blog.huguiqi.com.">副站</a></li>
					<li>
 					
						<form class="search" action="/search/index.html" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="text" id="search" autocomplete="on" class="st-default-search-input"  name="q" maxlength="30" placeholder="搜索" />
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/03/30/什么是SQL注入式攻击？/" title="什么是SQL注入式攻击？" itemprop="url">什么是SQL注入式攻击？</a>
  </h1>
  <p class="article-author">By
       
		<a href="https://plus.google.com/109318125124422212783?rel=author" title="sam hu" target="_blank" itemprop="author">sam hu</a>
		
  <p class="article-time">
    <time datetime="2016-03-30T09:08:53.000Z" itemprop="datePublished"> 发表于 2016-03-30</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#什么是SQL注入式攻击？"><span class="toc-number">1.</span> <span class="toc-text">什么是SQL注入式攻击？</span></a></li></ol>
		
		</div>
		
		<h1 id="&#x4EC0;&#x4E48;&#x662F;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#xFF1F;"><a href="#&#x4EC0;&#x4E48;&#x662F;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#xFF1F;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#xFF1F;"></a>&#x4EC0;&#x4E48;&#x662F;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#xFF1F;</h1><div><br><br><span style="FONT-SIZE: large">&#x4EC0;&#x4E48;&#x662F;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#xFF1F;\<br><br>&#x6240;&#x8C13;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#xFF0C;&#x5C31;&#x662F;&#x653B;&#x51FB;&#x8005;&#x628A;SQL&#x547D;&#x4EE4;&#x63D2;&#x5165;&#x5230;Web&#x8868;&#x5355;&#x7684;&#x8F93;&#x5165;&#x57DF;&#x6216;&#x9875;&#x9762;&#x8BF7;&#x6C42;&#x7684;&#x67E5;&#x8BE2;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6B3A;&#x9A97;&#x670D;&#x52A1;&#x5668;&#x6267;&#x884C;&#x6076;&#x610F;&#x7684;SQL&#x547D;&#x4EE4;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x8868;&#x5355;&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x76F4;&#x63A5;&#x7528;&#x6765;&#x6784;&#x9020;&#xFF08;&#x6216;&#x8005;&#x5F71;&#x54CD;&#xFF09;&#x52A8;&#x6001;SQL&#x547D;&#x4EE4;&#xFF0C;&#x6216;&#x4F5C;&#x4E3A;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x8F93;&#x5165;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x7C7B;&#x8868;&#x5355;&#x7279;&#x522B;&#x5BB9;&#x6613;&#x53D7;&#x5230;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#x3002;&#x5E38;&#x89C1;&#x7684;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#x8FC7;&#x7A0B;&#x7C7B;&#x5982;&#xFF1A;\<br> &#x2474; &#x67D0;&#x4E2A;ASP.NET<br>Web&#x5E94;&#x7528;&#x6709;&#x4E00;&#x4E2A;&#x767B;&#x5F55;&#x9875;&#x9762;&#xFF0C;&#x8FD9;&#x4E2A;&#x767B;&#x5F55;&#x9875;&#x9762;&#x63A7;&#x5236;&#x7740;&#x7528;&#x6237;&#x662F;&#x5426;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x5E94;&#x7528;&#xFF0C;&#x5B83;&#x8981;&#x6C42;&#x7528;&#x6237;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#x548C;&#x5BC6;&#x7801;&#x3002;\<br> &#x2475;<br>&#x767B;&#x5F55;&#x9875;&#x9762;&#x4E2D;&#x8F93;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x5C06;&#x76F4;&#x63A5;&#x7528;&#x6765;&#x6784;&#x9020;&#x52A8;&#x6001;&#x7684;SQL&#x547D;&#x4EE4;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x7528;&#x4F5C;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x53C2;&#x6570;&#x3002;&#x4E0B;&#x9762;&#x662F;ASP.NET&#x5E94;&#x7528;&#x6784;&#x9020;&#x67E5;&#x8BE2;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;\<br> System.Text.StringBuilder query = new System.Text.StringBuilder(\<br>     &#x201C;SELECT * from Users WHERE login = &#x2018;&#x201C;)\<br>     .Append(txtLogin.Text).Append(&#x201C;&#x2018; AND password=&#x2019;&#x201D;)\<br>     .Append(txtPassword.Text).Append(&#x201C;&#x2018;&#x201C;);\<br>\<br> &#x2476; &#x653B;&#x51FB;&#x8005;&#x5728;&#x7528;&#x6237;&#x540D;&#x5B57;&#x548C;&#x5BC6;&#x7801;&#x8F93;&#x5165;&#x6846;&#x4E2D;&#x8F93;&#x5165;&#x201D;&#x2018;&#x6216;&#x2019;1&#x2019;=&#x2019;1&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x5185;&#x5BB9;&#x3002;\<br> &#x2477;<br>&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x63D0;&#x4EA4;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x540E;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x8FD0;&#x884C;&#x4E0A;&#x9762;&#x7684;ASP.NET&#x4EE3;&#x7801;&#x6784;&#x9020;&#x51FA;&#x67E5;&#x8BE2;&#x7528;&#x6237;&#x7684;SQL&#x547D;&#x4EE4;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x653B;&#x51FB;&#x8005;&#x8F93;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x975E;&#x5E38;&#x7279;&#x6B8A;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;SQL&#x547D;&#x4EE4;&#x53D8;&#x6210;&#xFF1A;SELECT<br>* from Users WHERE login = &#x2018;&#x2019; or &#x2018;1&#x2019;=&#x2019;1&#x2019; AND password = &#x2018;&#x2019; or<br>&#x2018;1&#x2019;=&#x2019;1&#x2019;&#x3002;\<br> &#x2478;<br>&#x670D;&#x52A1;&#x5668;&#x6267;&#x884C;&#x67E5;&#x8BE2;&#x6216;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C06;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#x3002;\<br> &#x2479;<br>&#x7531;&#x4E8E;SQL&#x547D;&#x4EE4;&#x5B9E;&#x9645;&#x4E0A;&#x5DF2;&#x88AB;&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#x4FEE;&#x6539;&#xFF0C;&#x5DF2;&#x7ECF;&#x4E0D;&#x80FD;&#x771F;&#x6B63;&#x9A8C;&#x8BC1;&#x7528;&#x6237;&#x8EAB;&#x4EFD;&#xFF0C;&#x6240;&#x4EE5;&#x7CFB;&#x7EDF;&#x4F1A;&#x9519;&#x8BEF;&#x5730;&#x6388;&#x6743;&#x7ED9;&#x653B;&#x51FB;&#x8005;&#x3002;\<br><br>&#x5982;&#x679C;&#x653B;&#x51FB;&#x8005;&#x77E5;&#x9053;&#x5E94;&#x7528;&#x4F1A;&#x5C06;&#x8868;&#x5355;&#x4E2D;&#x8F93;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x76F4;&#x63A5;&#x7528;&#x4E8E;&#x9A8C;&#x8BC1;&#x8EAB;&#x4EFD;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x4ED6;&#x5C31;&#x4F1A;&#x5C1D;&#x8BD5;&#x8F93;&#x5165;&#x67D0;&#x4E9B;&#x7279;&#x6B8A;&#x7684;SQL&#x5B57;&#x7B26;&#x4E32;&#x7BE1;&#x6539;&#x67E5;&#x8BE2;&#x6539;&#x53D8;&#x5176;&#x539F;&#x6765;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6B3A;&#x9A97;&#x7CFB;&#x7EDF;&#x6388;&#x4E88;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;\<br><br>&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x4E0D;&#x540C;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x7684;&#x635F;&#x5BB3;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E3B;&#x8981;&#x7531;&#x5E94;&#x7528;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B89;&#x5168;&#x6743;&#x9650;&#x51B3;&#x5B9A;&#x3002;&#x5982;&#x679C;&#x7528;&#x6237;&#x7684;&#x5E10;&#x6237;&#x5177;&#x6709;&#x7BA1;&#x7406;&#x5458;&#x6216;&#x5176;&#x4ED6;&#x6BD4;&#x8F83;&#x9AD8;&#x7EA7;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x5C31;&#x53EF;&#x80FD;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8868;&#x6267;&#x884C;&#x5404;&#x79CD;&#x4ED6;&#x60F3;&#x8981;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5305;&#x62EC;&#x6DFB;&#x52A0;&#x3001;&#x5220;&#x9664;&#x6216;&#x66F4;&#x65B0;&#x6570;&#x636E;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x76F4;&#x63A5;&#x5220;&#x9664;&#x8868;\<br> &#x5982;&#x4F55;&#x9632;&#x8303;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#xFF1F;\<br><br>&#x597D;&#x5728;&#x8981;&#x9632;&#x6B62;ASP.NET&#x5E94;&#x7528;&#x88AB;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#x95EF;&#x5165;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x7279;&#x522B;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x5229;&#x7528;&#x8868;&#x5355;&#x8F93;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x6784;&#x9020;SQL&#x547D;&#x4EE4;&#x4E4B;&#x524D;&#xFF0C;&#x628A;&#x6240;&#x6709;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x8FC7;&#x6EE4;&#x4E00;&#x756A;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8FC7;&#x6EE4;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x6309;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x3002;\<br> &#x2474; &#x5BF9;&#x4E8E;&#x52A8;&#x6001;&#x6784;&#x9020;SQL&#x67E5;&#x8BE2;&#x7684;&#x573A;&#x5408;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x6280;&#x672F;&#xFF1A;\<br><br>&#x7B2C;&#x4E00;&#xFF1A;&#x66FF;&#x6362;&#x5355;&#x5F15;&#x53F7;&#xFF0C;&#x5373;&#x628A;&#x6240;&#x6709;&#x5355;&#x72EC;&#x51FA;&#x73B0;&#x7684;&#x5355;&#x5F15;&#x53F7;&#x6539;&#x6210;&#x4E24;&#x4E2A;&#x5355;&#x5F15;&#x53F7;&#xFF0C;&#x9632;&#x6B62;&#x653B;&#x51FB;&#x8005;&#x4FEE;&#x6539;SQL&#x547D;&#x4EE4;&#x7684;&#x542B;&#x4E49;&#x3002;&#x518D;&#x6765;&#x770B;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x201D;SELECT<br><a id="more"></a><br>* from Users WHERE login = &#x2018;&#x2019;&#x2019; or &#x2018;&#x2019;1&#x2019;&#x2019;=&#x2019;&#x2019;1&#x2019; AND password = &#x2018;&#x2019;&#x2019; or<br>&#x2018;&#x2019;1&#x2019;&#x2019;=&#x2019;&#x2019;1&#x2019;&#x201D;&#x663E;&#x7136;&#x4F1A;&#x5F97;&#x5230;&#x4E0E;&#x201D;SELECT * from Users WHERE login = &#x2018;&#x2019; or &#x2018;1&#x2019;=&#x2019;1&#x2019;<br>AND password = &#x2018;&#x2019; or &#x2018;1&#x2019;=&#x2019;1&#x2019;&#x201D;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;\<br> &#x7B2C;&#x4E8C;&#xFF1A;&#x5220;&#x9664;&#x7528;&#x6237;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8FDE;&#x5B57;&#x7B26;&#xFF0C;&#x9632;&#x6B62;&#x653B;&#x51FB;&#x8005;&#x6784;&#x9020;&#x51FA;&#x7C7B;&#x5982;&#x201D;SELECT *<br>from Users WHERE login = &#x2018;mas&#x2019; &#x2013; AND password<br>=&#x2019;&#x2019;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x7C7B;&#x67E5;&#x8BE2;&#x7684;&#x540E;&#x534A;&#x90E8;&#x5206;&#x5DF2;&#x7ECF;&#x88AB;&#x6CE8;&#x91CA;&#x6389;&#xFF0C;&#x4E0D;&#x518D;&#x6709;&#x6548;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x53EA;&#x8981;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x5408;&#x6CD5;&#x7684;&#x7528;&#x6237;&#x767B;&#x5F55;&#x540D;&#x79F0;&#xFF0C;&#x6839;&#x672C;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7528;&#x6237;&#x7684;&#x5BC6;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x987A;&#x5229;&#x83B7;&#x5F97;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;\<br><br>&#x7B2C;&#x4E09;&#xFF1A;&#x5BF9;&#x4E8E;&#x7528;&#x6765;&#x6267;&#x884C;&#x67E5;&#x8BE2;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5E10;&#x6237;&#xFF0C;&#x9650;&#x5236;&#x5176;&#x6743;&#x9650;&#x3002;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x5E10;&#x6237;&#x6267;&#x884C;&#x67E5;&#x8BE2;&#x3001;&#x63D2;&#x5165;&#x3001;&#x66F4;&#x65B0;&#x3001;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x3002;&#x7531;&#x4E8E;&#x9694;&#x79BB;&#x4E86;&#x4E0D;&#x540C;&#x5E10;&#x6237;&#x53EF;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x800C;&#x4E5F;&#x5C31;&#x9632;&#x6B62;&#x4E86;&#x539F;&#x672C;&#x7528;&#x4E8E;&#x6267;&#x884C;SELECT&#x547D;&#x4EE4;&#x7684;&#x5730;&#x65B9;&#x5374;&#x88AB;&#x7528;&#x4E8E;&#x6267;&#x884C;INSERT&#x3001;UPDATE&#x6216;DELETE&#x547D;&#x4EE4;&#x3002;\<br> &#x2475;<br>&#x7528;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x6765;&#x6267;&#x884C;&#x6240;&#x6709;&#x7684;&#x67E5;&#x8BE2;&#x3002;SQL&#x53C2;&#x6570;&#x7684;&#x4F20;&#x9012;&#x65B9;&#x5F0F;&#x5C06;&#x9632;&#x6B62;&#x653B;&#x51FB;&#x8005;&#x5229;&#x7528;&#x5355;&#x5F15;&#x53F7;&#x548C;&#x8FDE;&#x5B57;&#x7B26;&#x5B9E;&#x65BD;&#x653B;&#x51FB;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5B83;&#x8FD8;&#x4F7F;&#x5F97;&#x6570;&#x636E;&#x5E93;&#x6743;&#x9650;&#x53EF;&#x4EE5;&#x9650;&#x5236;&#x5230;&#x53EA;&#x5141;&#x8BB8;&#x7279;&#x5B9A;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x6267;&#x884C;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7528;&#x6237;&#x8F93;&#x5165;&#x5FC5;&#x987B;&#x9075;&#x4ECE;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x5B89;&#x5168;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5F88;&#x96BE;&#x518D;&#x53D1;&#x751F;&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#x4E86;&#x3002;\<br> &#x2476;<br>&#x9650;&#x5236;&#x8868;&#x5355;&#x6216;&#x67E5;&#x8BE2;&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x5165;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x7528;&#x6237;&#x7684;&#x767B;&#x5F55;&#x540D;&#x5B57;&#x6700;&#x591A;&#x53EA;&#x6709;10&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x8981;&#x8BA4;&#x53EF;&#x8868;&#x5355;&#x4E2D;&#x8F93;&#x5165;&#x7684;10&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x8FD9;&#x5C06;&#x5927;&#x5927;&#x589E;&#x52A0;&#x653B;&#x51FB;&#x8005;&#x5728;SQL&#x547D;&#x4EE4;&#x4E2D;&#x63D2;&#x5165;&#x6709;&#x5BB3;&#x4EE3;&#x7801;&#x7684;&#x96BE;&#x5EA6;&#x3002;\<br> &#x2477;<br>&#x68C0;&#x67E5;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x5408;&#x6CD5;&#x6027;&#xFF0C;&#x786E;&#x4FE1;&#x8F93;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x53EA;&#x5305;&#x542B;&#x5408;&#x6CD5;&#x7684;&#x6570;&#x636E;&#x3002;&#x6570;&#x636E;&#x68C0;&#x67E5;&#x5E94;&#x5F53;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x90FD;&#x6267;&#x884C;&#x2014;&#x2014;&#x4E4B;&#x6240;&#x4EE5;&#x8981;&#x6267;&#x884C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x9A8C;&#x8BC1;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x5F25;&#x8865;&#x5BA2;&#x6237;&#x7AEF;&#x9A8C;&#x8BC1;&#x673A;&#x5236;&#x8106;&#x5F31;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;\<br><br>&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x5B8C;&#x5168;&#x6709;&#x53EF;&#x80FD;&#x83B7;&#x5F97;&#x7F51;&#x9875;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x4FEE;&#x6539;&#x9A8C;&#x8BC1;&#x5408;&#x6CD5;&#x6027;&#x7684;&#x811A;&#x672C;&#xFF08;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x5220;&#x9664;&#x811A;&#x672C;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x975E;&#x6CD5;&#x5185;&#x5BB9;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x8868;&#x5355;&#x63D0;&#x4EA4;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8981;&#x4FDD;&#x8BC1;&#x9A8C;&#x8BC1;&#x64CD;&#x4F5C;&#x786E;&#x5B9E;&#x5DF2;&#x7ECF;&#x6267;&#x884C;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x4E5F;&#x6267;&#x884C;&#x9A8C;&#x8BC1;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BB8;&#x591A;&#x5185;&#x5EFA;&#x7684;&#x9A8C;&#x8BC1;&#x5BF9;&#x8C61;&#xFF0C;&#x4F8B;&#x5982;<br>RegularExpressionValidator&#xFF0C;&#x5B83;&#x4EEC;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x9A8C;&#x8BC1;&#x7528;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x811A;&#x672C;&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x63D2;&#x5165;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x3002;&#x5982;&#x679C;&#x627E;&#x4E0D;&#x5230;&#x73B0;&#x6210;&#x7684;&#x9A8C;&#x8BC1;&#x5BF9;&#x8C61;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;CustomValidator&#x81EA;&#x5DF1;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x3002;\<br> &#x2478;<br>&#x5C06;&#x7528;&#x6237;&#x767B;&#x5F55;&#x540D;&#x79F0;&#x3001;&#x5BC6;&#x7801;&#x7B49;&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x4FDD;&#x5B58;&#x3002;&#x52A0;&#x5BC6;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5C06;&#x5B83;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x6570;&#x636E;&#x6BD4;&#x8F83;&#xFF0C;&#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x5BF9;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x4E86;&#x201D;&#x6D88;&#x6BD2;&#x201D;&#x5904;&#x7406;&#xFF0C;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x518D;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x6709;&#x4EFB;&#x4F55;&#x7279;&#x6B8A;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x4ECE;&#x800C;&#x4E5F;&#x5C31;&#x9632;&#x6B62;&#x4E86;&#x653B;&#x51FB;&#x8005;&#x6CE8;&#x5165;SQL&#x547D;&#x4EE4;&#x3002;<br>System.Web.Security.FormsAuthentication&#x7C7B;&#x6709;&#x4E00;&#x4E2A;<br>HashPasswordForStoringInConfigFile&#xFF0C;&#x975E;&#x5E38;&#x9002;&#x5408;&#x4E8E;&#x5BF9;&#x8F93;&#x5165;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6D88;&#x6BD2;&#x5904;&#x7406;&#x3002;\<br> &#x2479;<br>&#x68C0;&#x67E5;&#x63D0;&#x53D6;&#x6570;&#x636E;&#x7684;&#x67E5;&#x8BE2;&#x6240;&#x8FD4;&#x56DE;&#x7684;&#x8BB0;&#x5F55;&#x6570;&#x91CF;&#x3002;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x53EA;&#x8981;&#x6C42;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x8FD4;&#x56DE;&#x7684;&#x8BB0;&#x5F55;&#x5374;&#x8D85;&#x8FC7;&#x4E00;&#x884C;&#xFF0C;&#x90A3;&#x5C31;&#x5F53;&#x4F5C;&#x51FA;&#x9519;&#x5904;&#x7406;\<br></span><br><br></div>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/专业技术-印象笔记/">专业技术(印象笔记)</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/从印象笔记导入/">从印象笔记导入</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	  <div data-url="http://blog.huguiqi.com/2016/03/30/什么是SQL注入式攻击？/" data-title="什么是SQL注入式攻击？ | 小黑的技术博客" data-tsina="1601653200" class="share clearfix">
	  </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2016/03/30/什么是 Docker | Docker —— 从入门到实践/" title="什么是 Docker | Docker —— 从入门到实践">
  <strong>上一篇：</strong><br/>
  <span>
  什么是 Docker | Docker —— 从入门到实践</span>
</a>
</div>


<div class="next">
<a href="/2016/03/30/从用户友好性看中文长度的校验(页面与数据库对字符长度的不同表示)/"  title="从用户友好性看中文长度的校验(页面与数据库对字符长度的不同表示)">
 <strong>下一篇：</strong><br/> 
 <span>从用户友好性看中文长度的校验(页面与数据库对字符长度的不同表示)
</span>
</a>
</div>

</nav>

	
<section id="comments" class="comment">
	<div class="ds-thread" data-thread-key="2016/03/30/什么是SQL注入式攻击？/" data-title="什么是SQL注入式攻击？" data-url="http://blog.huguiqi.com/2016/03/30/什么是SQL注入式攻击？/"></div>
</section>


<section id="comments" class="comment">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>

</div>  
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#什么是SQL注入式攻击？"><span class="toc-number">1.</span> <span class="toc-text">什么是SQL注入式攻击？</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="github-card">
<p class="asidetitle">Github 名片</p>
<div class="github-card" data-github="huguiqi" data-width="220" data-height="119" data-theme="medium">
<script type="text/javascript" src="//cdn.jsdelivr.net/github-cards/latest/widget.js" ></script>
</div>
  </div>



  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/Alcatraz/" title="Alcatraz">Alcatraz<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/docker/" title="docker">docker<sup>4</sup></a></li>
		  
		
		  
			<li><a href="/categories/git/" title="git">git<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/github-博客/" title="github 博客">github 博客<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/hexo插件/" title="hexo插件">hexo插件<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/ios-Developer/" title="ios Developer">ios Developer<sup>5</sup></a></li>
		  
		
		  
			<li><a href="/categories/javascript/" title="javascript">javascript<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/nodejs/" title="nodejs">nodejs<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/专业技术-印象笔记/" title="专业技术(印象笔记)">专业技术(印象笔记)<sup>222</sup></a></li>
		  
		
		  
			<li><a href="/categories/前端技术/" title="前端技术">前端技术<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/感悟/" title="感悟">感悟<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/杂谈/" title="杂谈">杂谈<sup>5</sup></a></li>
		  
		
		  
		
		  
			<li><a href="/categories/站内搜索-博客/" title="站内搜索 博客">站内搜索 博客<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/管理/" title="管理">管理<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/系统-工具/" title="系统&amp;工具">系统&amp;工具<sup>6</sup></a></li>
		  
		
		  
			<li><a href="/categories/系统-运维/" title="系统&amp;运维">系统&amp;运维<sup>11</sup></a></li>
		  
		
		  
			<li><a href="/categories/网络配置/" title="网络配置">网络配置<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>4</sup></a></li>
		  
		
		  
			<li><a href="/categories/面试题/" title="面试题">面试题<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/从印象笔记导入/" title="从印象笔记导入">从印象笔记导入<sup>222</sup></a></li>
			
		
			
				<li><a href="/tags/随笔/" title="随笔">随笔<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/ios-developer-upload/" title="ios developer upload">ios developer upload<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/docker-国内镜像/" title="docker 国内镜像">docker 国内镜像<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/javascript-原型编程/" title="javascript&amp;原型编程">javascript&amp;原型编程<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/macbook电池保养/" title="macbook电池保养">macbook电池保养<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/3DTouch-sample/" title="3DTouch sample">3DTouch sample<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/ios-developer-上传审核/" title="ios developer 上传审核">ios developer 上传审核<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/docker升级/" title="docker升级">docker升级<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/面试题-全栈/" title="面试题 全栈">面试题 全栈<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/安装svn/" title="安装svn">安装svn<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitlabe-ce/" title="gitlabe-ce">gitlabe-ce<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/macbook显卡门/" title="macbook显卡门">macbook显卡门<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/iptables与docker的作死碰撞/" title="iptables与docker的作死碰撞">iptables与docker的作死碰撞<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/nginx/" title="nginx">nginx<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/express-异常处理/" title="express 异常处理">express 异常处理<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/oh-my-zsh-vim-macos/" title="oh-my-zsh vim macos">oh-my-zsh vim macos<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/PM2/" title="PM2">PM2<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/svn与git/" title="svn与git">svn与git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/三体/" title="三体">三体<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://godeggs.cn " target="_blank" title="承接手机app、微信、web开发">找人做软件</a>
            
          </li>
        
          <li>
            
            	<a href="http://blog.huguiqi.com." target="_blank" title="sam&#39;s Blog">sam&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  

<div class="doubanshow">
<p class="asidetitle">豆瓣秀</p>
<div>
<script type="text/javascript" src="http://www.douban.com/service/badge/64698454/?show=collection&amp;n=12&amp;columns=3&amp;hidelogo=yes&amp;hideself=yes&amp;cat=book|movie" ></script>
</div>
</div>


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

  <div class="weiboshow">
  <p class="asidetitle">新浪微博</p>
    <iframe width="100%" height="119" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=119&fansRow=2&ptype=1&speed=0&skin=9&isTitle=1&noborder=1&isWeibo=0&isFans=0&uid=1601653200&verifier=bd864c6a&dpc=1"></iframe>
</div>


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Sam.This is my Blog. <br/>
			Anything that can go wrong will go wrong</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/1601653200" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/huguiqi" target="_blank" class="icon-github" title="github"></a>
		
		
		
		<a href="https://twitter.com/XiaoheiSpring" target="_blank" class="icon-twitter" title="twitter"></a>
		
		
		<a href="https://www.facebook.com/sam.hu.7334" target="_blank" class="icon-facebook" title="facebook"></a>
		
		
		<a href="https://www.linkedin.com/in/小黑-胡-ab83b992" target="_blank" class="icon-linkedin" title="linkedin"></a>
		
		
		<a href="https://www.douban.com/people/64698454" target="_blank" class="icon-douban" title="豆瓣"></a>
		
		
		<a href="http://www.zhihu.com/people/hu-xiao-hei-53" target="_blank" class="icon-zhihu" title="知乎"></a>
		
		
		<a href="https://plus.google.com/109318125124422212783?rel=author" target="_blank" class="icon-google_plus" title="Google+"></a>
		
		
		<a href="mailto:guiqi.hu@163.com" target="_blank" class="icon-email" title="Email Me"></a>
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="http://blog.huguiqi.com." target="_blank" title="sam">sam</a> © 2017 
		
		<a href="/about" target="_blank" title="sam hu">sam hu</a>
		
		
		</p>
</div>

 <script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
  (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
  e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');
  
  _st('install','qtnHgvQyg5N9h4en-9wA','2.0.0');
</script>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina'),
      description = $this.attr('description');
  var html = [
  '<div class="hoverqrcode clearfix"></div>',
  '<a class="overlay" id="qrcode"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="微信"></a>',
  '<a href="http://widget.renren.com/dialog/share?resourceUrl=' + encodedUrl + '&srcUrl=' + encodedUrl + '&title=' + title +'" class="article-share-renren" target="_blank" title="人人"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="微博"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);

  $('.hoverqrcode').hide();

  var myWidth = 0;
  function updatehoverqrcode(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
    var qrsize = myWidth > 1024 ? 200:100;
    var options = {render: 'image', size: qrsize, fill: '#2ca6cb', text: url, radius: 0.5, quiet: 1};
    var p = $('.article-share-qrcode').position();
    $('.hoverqrcode').empty().css('width', qrsize).css('height', qrsize)
                          .css('left', p.left-qrsize/2+20).css('top', p.top-qrsize-10)
                          .qrcode(options);
  };
  $(window).resize(function(){
    $('.hoverqrcode').hide();
  });
  $('.article-share-qrcode').click(function(){
    updatehoverqrcode();
    $('.hoverqrcode').toggle();
  });
  $('.article-share-qrcode').hover(function(){}, function(){
      $('.hoverqrcode').hide();
  });
});   
</script>



<script type="text/javascript">
  var duoshuoQuery = {short_name:"小黑_spring"};
  (function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0] 
    || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
</script> 


<script type="text/javascript">

var disqus_shortname = 'huguiqicom';

(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
</script>






<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->



<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?f5971877c7b77f98074be3ddabf34fbe";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>



<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
