
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>加菲猫生活歪理 | 小黑的技术博客</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="sam hu">
    
    <meta name="baidu-site-verification" content="zBj0BDqjSV" />
    
    <meta name="description" content="&amp;#x52A0;&amp;#x83F2;&amp;#x732B;&amp;#x751F;&amp;#x6D3B;&amp;#x6B6A;&amp;#x7406;&amp;#xFFFC;\\\\\&amp;#x52A0;&amp;#x83F2;&amp;#x732B;&amp;#x751F;&amp;#x6D3B;&amp;#x6B6A;&amp;#x7406;\\\\1&amp;#x3001; &amp;#x4ECA;&amp;#x5929;&amp;#x5403;&amp;#x5F97;&amp;#x4E0B;&amp;#x7684;&amp;#x5343;&amp;#x4E">
<meta property="og:type" content="article">
<meta property="og:title" content="加菲猫生活歪理">
<meta property="og:url" content="http://www.huguiqi.com/2016/03/30/加菲猫生活歪理/index.html">
<meta property="og:site_name" content="小黑的技术博客">
<meta property="og:description" content="&amp;#x52A0;&amp;#x83F2;&amp;#x732B;&amp;#x751F;&amp;#x6D3B;&amp;#x6B6A;&amp;#x7406;&amp;#xFFFC;\\\\\&amp;#x52A0;&amp;#x83F2;&amp;#x732B;&amp;#x751F;&amp;#x6D3B;&amp;#x6B6A;&amp;#x7406;\\\\1&amp;#x3001; &amp;#x4ECA;&amp;#x5929;&amp;#x5403;&amp;#x5F97;&amp;#x4E0B;&amp;#x7684;&amp;#x5343;&amp;#x4E">
<meta property="og:updated_time" content="2016-03-30T09:08:53.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="加菲猫生活歪理">
<meta name="twitter:description" content="&amp;#x52A0;&amp;#x83F2;&amp;#x732B;&amp;#x751F;&amp;#x6D3B;&amp;#x6B6A;&amp;#x7406;&amp;#xFFFC;\\\\\&amp;#x52A0;&amp;#x83F2;&amp;#x732B;&amp;#x751F;&amp;#x6D3B;&amp;#x6B6A;&amp;#x7406;\\\\1&amp;#x3001; &amp;#x4ECA;&amp;#x5929;&amp;#x5403;&amp;#x5F97;&amp;#x4E0B;&amp;#x7684;&amp;#x5343;&amp;#x4E">
<meta name="twitter:creator" content="@XiaoheiSpring">
<link rel="publisher" href="109318125124422212783">

    
    <link rel="alternative" href="/atom.xml" title="小黑的技术博客" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="小黑的技术博客" title="小黑的技术博客"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="小黑的技术博客">小黑的技术博客</a></h1>
				<h2 class="blog-motto">技术分享与学习，聚沙成塔!</h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/about">关于</a></li>
					
					<li><a href="http://blog.huguiqi.com.">副站</a></li>
					<li>
 					
						<form class="search" action="/search/index.html" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="text" id="search" autocomplete="on" class="st-default-search-input"  name="q" maxlength="30" placeholder="搜索" />
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/03/30/加菲猫生活歪理/" title="加菲猫生活歪理" itemprop="url">加菲猫生活歪理</a>
  </h1>
  <p class="article-author">By
       
		<a href="https://plus.google.com/109318125124422212783?rel=author" title="sam hu" target="_blank" itemprop="author">sam hu</a>
		
  <p class="article-time">
    <time datetime="2016-03-30T09:08:53.000Z" itemprop="datePublished"> 发表于 2016-03-30</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#加菲猫生活歪理"><span class="toc-number">1.</span> <span class="toc-text">加菲猫生活歪理</span></a></li></ol>
		
		</div>
		
		<h1 id="&#x52A0;&#x83F2;&#x732B;&#x751F;&#x6D3B;&#x6B6A;&#x7406;"><a href="#&#x52A0;&#x83F2;&#x732B;&#x751F;&#x6D3B;&#x6B6A;&#x7406;" class="headerlink" title="&#x52A0;&#x83F2;&#x732B;&#x751F;&#x6D3B;&#x6B6A;&#x7406;"></a>&#x52A0;&#x83F2;&#x732B;&#x751F;&#x6D3B;&#x6B6A;&#x7406;</h1><p>&#xFFFC;\<br>\<br>\<br>\<br>\<br>&#x52A0;&#x83F2;&#x732B;&#x751F;&#x6D3B;&#x6B6A;&#x7406;\<br>\<br>\<br>\<br>1&#x3001; &#x4ECA;&#x5929;&#x5403;&#x5F97;&#x4E0B;&#x7684;&#x5343;&#x4E07;&#x522B;&#x6401;&#x5230;&#x660E;&#x5929;&#x3002;\<br>\<br>\<br>2&#x3001;&#x7231;&#x60C5;&#x6765;&#x5F97;&#x5FEB;&#x53BB;&#x5F97;&#x4E5F;&#x5FEB;&#xFF0C;&#x53EA;&#x6709;&#x732A;&#x8089;&#x5377;&#x662F;&#x6C38;&#x6052;&#x7684;&#x3002;\<br>\<br>\<br>3&#x3001;&#x6B27;&#x8FEA;&#xFF0C;&#x6211;&#x4EEC;&#x53BB;&#x5403;&#x51B0;&#x6DC7;&#x6DCB;&#x5427;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F60;&#x5F97;&#x770B;&#x7740;&#x6211;&#x5403;&#x3002;\<br>\<br>\<br>4&#x3001;&#x809A;&#x5B50;&#x5927;&#x4E0D;&#x53EF;&#x6015;&#xFF0C;&#x53EF;&#x6015;&#x7684;&#x662F;&#x809A;&#x5B50;&#x91CC;&#x6CA1;&#x6709;&#x597D;&#x4E1C;&#x897F;&#x3002;\<br>\<br>\<br>5&#x3001;&#x300C;&#x6B27;&#x8FEA;&#x5728;&#x7A97;&#x5916;&#x51BB;&#x5F97;&#x745F;&#x745F;&#x53D1;&#x6296;&#xFF0C;&#x771F;&#x53EF;&#x601C;&#x3002;&#x6211;&#x771F;&#x6709;&#x70B9;&#x4E0D;&#x5FCD;&#x5FC3;&#x770B;&#x4ED6;&#x8FD9;&#x6837;&#x3002;\<br>\<br>\<br>&#x4E0D;&#xFF0C;&#x96BE;&#x9053;&#x6211;&#x80FD;&#x5750;&#x89C6;&#x4E0D;&#x7BA1;&#x5417;&#xFF1F;&#x6211;&#x5FC5;&#x987B;&#x505A;&#x70B9;&#x4EC0;&#x4E48;&#x3002;&#x300D;&#x52A0;&#x83F2;&#x62C9;&#x4E0A;&#x4E86;&#x7A97;&#x5E18;&#x3002;\<br>\<br>\<br>6&#x3001; &#x5931;&#x8D25;&#x7684;&#x4EBA;&#x7279;&#x70B9;&#x662F;&#x4F1A;&#x4E0D;&#x65AD;&#x5730;&#x5931;&#x8D25;&#x3002;\<br>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x770B;&#x770B;&#x4ED6;&#x7684;&#x5931;&#x8D25;&#x7684;&#x8BDD;&#xFF0C;&#x4ED6;&#x662F;&#x4E0D;&#x4F1A;&#x8BA9;&#x4F60;&#x5931;&#x671B;&#x7684;&#x3002;\<br>\<br>\<br>\<br>\<br><a id="more"></a><br>\<br>7&#x3001;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x80FD;&#x51FB;&#x8D25;&#x4F60;&#x7684;&#x654C;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x52A0;&#x5165;&#x4ED6;&#x4EEC;&#x3002;\<br>\<br>\<br>8&#x3001; &#x7403;&#x72B6;&#x4E5F;&#x662F;&#x8EAB;&#x6750;&#x3002;\<br>\<br>\<br>9&#x3001;&#x6211;&#x5411;&#x661F;&#x661F;&#x8BB8;&#x4E86;&#x4E2A;&#x613F;&#x3002;&#x6211;&#x5E76;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x76F8;&#x4FE1;&#x5B83;&#xFF0C;&#x4F46;&#x662F;&#x53CD;&#x6B63;&#x4E5F;&#x662F;&#x514D;&#x8D39;&#x7684;&#xFF0C;\<br>&#x800C;&#x4E14;&#x4E5F;&#x6CA1;&#x6709;&#x8BC1;&#x636E;&#x8BC1;&#x660E;&#x5B83;&#x4E0D;&#x7075;&#x3002;\<br>\<br>10&#x3001;&#x7761;&#x4E86;&#x7F8E;&#x7F8E;&#x7684;&#x4E00;&#x89C9;&#xFF0C;16&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x6211;&#x662F;&#x559C;&#x6B22;&#x7761;&#x77ED;&#x89C9;&#x7684;&#x3002;\<br>\<br>\<br>11&#x3001;&#x52A0;&#x83F2;&#x5728;&#x996D;&#x684C;&#x65C1;&#x7B49;&#x7740;&#x5F00;&#x996D;&#xFF0C;&#x4E54;&#x6069;&#x5374;&#x5FD9;&#x7740;&#x8981;&#x51FA;&#x95E8;&#x3002;\<br>&#x52A0;&#x83F2;&#xFF1A;&#x55E8;&#xFF0C;&#x4F60;&#x6CA1;&#x6709;&#x5FD8;&#x8BB0;&#x4EC0;&#x4E48;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x5417;&#xFF1F;\<br>&#x2026;&#x2026;.??\<br>&#x52A0;&#x83F2;&#xFF1A;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x6709;&#x4E9B;&#x5DDE;&#x5524;&#x732B;&#x505A;&#x65E9;&#x996D;&#x662F;&#x91CD;&#x7F6A;&#x3002;\<br>\<br>\<br>12&#x3001;&#x6211;&#x5E76;&#x4E0D;&#x80D6;&#x3002;&#x6309;&#x7167;&#x6211;&#x7684;&#x4F53;&#x91CD;&#x6211;&#x53EA;&#x662F;&#x7A0D;&#x5FAE;&#x77EE;&#x4E86;&#x4E00;&#x70B9;&#x3002;\<br>\<br>\<br>13&#x3001;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x663E;&#x5F97;&#x806A;&#x660E;&#xFF0C;&#x5C31;&#x8981;&#x591A;&#x8DDF;&#x8822;&#x4EBA;&#x4E3A;&#x4F0D;&#x3002;\<br>\<br>\<br>14&#x3001;&#x6211;&#x80D6;&#x6211;&#x61D2;&#x2014;&#x2014;&#x53EF;&#x662F;&#x6211;&#x81EA;&#x8C6A;&#xFF01;\<br>\<br>\<br>15&#x3001;&#x5DE5;&#x4F5C;&#x597D;&#x6709;&#x610F;&#x601D;&#x8036;&#xFF01;&#x5C24;&#x5176;&#x662F;&#x770B;&#x7740;&#x522B;&#x4EBA;&#x5DE5;&#x4F5C;&#x3002;\<br>\<br>\<br>16&#x3001;&#x5982;&#x679C;&#x65E9;&#x6668;&#x665A;&#x4E00;&#x70B9;&#x513F;&#x6765;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4F1A;&#x559C;&#x6B22;&#x65E9;&#x6668;&#x7684;&#x3002;\<br>\<br>\<br>17&#x3001;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5E94;&#x8BE5;&#x70ED;&#x7231;&#x52A8;&#x7269;,&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5F88;&#x597D;&#x5403;&#x3002;\<br>\<br>\<br>18&#x3001;&#x8981;&#x7528;&#x5FC3;&#x53BB;&#x7231;&#x4F60;&#x7684;&#x90BB;&#x5C45;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E0D;&#x8981;&#x8BA9;&#x5979;&#x7684;&#x8001;&#x516C;&#x77E5;&#x9053;&#x3002;\<br>\<br>\<br>19&#x3001;&#x4E0D;&#x8981;&#x7B49;&#x660E;&#x5929;&#x4EA4;&#x4E0D;&#x4E0A;&#x5DEE;&#x518D;&#x627E;&#x501F;&#x53E3;&#xFF0C;&#x4ECA;&#x5929;&#x5C31;&#x8981;&#x627E;&#x597D;&#x3002;\<br>\<br>\<br>20&#x3001;&#x61D2;&#x60F0;&#x6709;&#x4E00;&#x70B9;&#x7279;&#x522B;&#x62DB;&#x4EBA;&#x559C;&#x6B22;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#xFF0C;&#x4E0D;&#x7528;&#x5B66;&#x5C31;&#x4F1A;&#x3002;\<br>\<br>\<br>21&#x3001;&#x54E6;&#xFF1F;&#x5403;&#x8001;&#x9F20;&#xFF1F;&#x5982;&#x679C;&#x4E16;&#x754C;&#x4E0A;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x610F;&#x5927;&#x5229;&#x9762;&#xFF0C;&#x90A3;&#x8FD8;&#x5403;&#x8001;&#x9F20;&#x5E72;&#x4EC0;&#x4E48;&#xFF1F;\<br>\<br>\<br>22&#x3001;&#x5DE7;&#x514B;&#x529B;&#x7684;&#x9EBB;&#x70E6;&#x662F;&#xFF1A;&#x4F60;&#x628A;&#x5B83;&#x5403;&#x4E86;,&#x5B83;&#x5C31;&#x6CA1;&#x4E86;&#x3002;\<br>\<br>\<br>23&#x3001;&#x949E;&#x7968;&#x4E0D;&#x662F;&#x4E07;&#x80FD;&#x7684;&#xFF0C;&#x6709;&#x65F6;&#x8FD8;&#x9700;&#x8981;&#x4FE1;&#x7528;&#x5361;&#x3002;\<br>\<br>\<br>24&#x3001;&#x8981;&#x8282;&#x7EA6;&#x7528;&#x6C34;&#xFF0C;&#x5C3D;&#x91CF;&#x548C;&#x5973;&#x53CB;&#x4E00;&#x8D77;&#x6D17;&#x6FA1;&#x3002;\<br>\<br>\<br>25&#x3001;&#x795E;&#x51B3;&#x5B9A;&#x4E86;&#x8C01;&#x662F;&#x4F60;&#x7684;&#x4EB2;&#x621A;&#xFF0C;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x5728;&#x9009;&#x62E9;&#x670B;&#x53CB;&#x65B9;&#x9762;&#x4ED6;&#x7ED9;&#x4F60;&#x7559;&#x4E86;&#x4F59;&#x5730;&#x3002;\<br>\<br>\<br>26&#x3001;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x6BD4;&#x94B1;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x610F;&#x5927;&#x5229;&#x9762;&#x3002;\<br>\<br>\<br>27&#x3001;&#x6709;&#x4EBA;&#x7BA1;&#x8FD9;&#x53EB;&#x61D2;&#x60F0;&#xFF0C;&#x6211;&#x79F0;&#x5176;&#x4E3A;&#x6DF1;&#x601D;&#x3002;\<br>\<br>\<br>28&#x3001;&#x4E54;&#x6069;&#xFF1A;&#x52A0;&#x83F2;&#xFF01;&#x4F60;&#x4E0D;&#x662F;&#x8BF4;&#x4F60;&#x53EA;&#x5403;&#x5230;&#x4E0B;&#x5348;&#x4E09;&#x70B9;&#x5417;&#xFF1F;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x4E94;&#x70B9;&#x4E86;&#xFF01;\<br>\<br>\<br>&#x52A0;&#x83F2;&#xFF1A;&#x662F;&#x554A;&#xFF0C;&#x6211;&#x662F;&#x8BF4;&#x5403;&#x5230;&#x4E0B;&#x5348;&#x4E09;&#x70B9;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x6CA1;&#x8BF4;&#x54EA;&#x4E00;&#x5929;&#x554A;&#x3002;\<br>\<br>\<br>29&#x3001;&#x4E54;&#x6069;:&#x52A0;&#x83F2;&#x732B;&#xFF0C;&#x4F60;&#x731C;&#x6211;&#x7ED9;&#x4F60;&#x5E26;&#x4EC0;&#x4E48;&#x6765;&#x4E86;&#xFF1F;\<br>&#x52A0;&#x83F2;&#xFF1A;&#x4E0D;&#x7BA1;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x5403;&#x5C31;&#x884C;&#x3002;\<br>\<br>\<br>\<br>\<br>\<br>30&#x3001;&#x4E54;&#x6069;&#x5728;&#x6D17;&#x6FA1;&#xFF0C;&#x52A0;&#x83F2;&#x5728;&#x7761;&#x89C9;&#x3002;\<br>&#x52A0;&#x83F2;&#xFF1A;&#x90A3;&#x4E9B;&#x4E00;&#x8FB9;&#x6D17;&#x6FA1;&#x4E00;&#x8FB9;&#x5531;&#x6B4C;&#x7684;&#x4EBA;&#x5E94;&#x8BE5;&#x62C9;&#x5230;&#x8857;&#x4E0A;&#x53BB;&#x67AA;&#x6BD9;&#x3002;\<br>\<br>\<br>\<br>31&#x3001;&#x52A0;&#x83F2;&#x732B;&#x8282;&#x98DF;&#x79D8;&#x8BC0;&#xFF1A;\<br>\<br>\<br>1.&#x4E0D;&#x8981;&#x6253;&#x7B97;&#x5403;&#x4E0D;&#x591F;&#x518D;&#x6765;&#x7B2C;&#x4E8C;&#x8F6E;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5C31;&#x8981;&#x62FF;&#x591F;&#x98DF;&#x7269;\<br>2.&#x628A;&#x78C5;&#x79E4;&#x7684;&#x96F6;&#x70B9;&#x8C03;&#x6210;&#x8D1F;5&#x516C;&#x65A4; 3.&#x7EDD;&#x5BF9;&#x4E0D;&#x5403;&#x51CF;&#x80A5;&#x7CD6;\<br>4.&#x4E0D;&#x8981;&#x7ED3;&#x4EA4;&#x5BB6;&#x91CC;&#x5F00;&#x9910;&#x5385;&#x6216;&#x7CD5;&#x997C;&#x5E97;&#x7684;&#x5973;&#x670B;&#x53CB;\<br>5.&#x51CF;&#x80A5;&#x5E94;&#x591A;&#x5403;&#x852C;&#x83DC;&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x591A;&#x5403;&#x5357;&#x74DC;&#x6D3E;&#xFF0C;&#x852C;&#x83DC;&#x997C;&#x5E72;&#x7B49;\<br>6.&#x51B7;&#x98DF;&#x4E0D;&#x5B9C;&#x591A;&#x5403;&#xFF08;&#x4F46;&#x51B0;&#x6DC7;&#x6DCB;&#x9664;&#x5916;&#xFF09;7.&#x6BCF;&#x9910;&#x7559;&#x4E00;&#x70B9;&#x513F;&#xFF0C;&#x4E0D;&#x8981;&#x7EDF;&#x7EDF;&#x5403;&#x4E0B;&#x809A;&#x2014;&#x2014;\<br>&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;&#x51B0;&#x6DC7;&#x6DCB;&#x5723;&#x4EE3;&#x4E0A;&#x7684;&#x90A3;&#x9897;&#x6A31;&#x6843;&#xFF09;8.&#x591A;&#x8DDF;&#x6BD4;&#x4F60;&#x80D6;&#x7684;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x3002;\<br>\<br>\<br>32&#x3001;&#x503C;&#x5F97;&#x505A;&#x7684;&#x4E8B;&#x90FD;&#x503C;&#x5F97;&#x4E00;&#x505A;&#x518D;&#x505A;&#x3002;\<br>\<br>\<br>33&#x3001;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x7528;&#x82F1;&#x8BED;&#x6765;&#x8BF4;&#x4E2D;&#x56FD;&#x8BDD;&#xFF1F;&#x5426;&#x5219;&#x4EC0;&#x4E48;&#x90FD;&#x522B;&#x8BF4;&#x3002;\<br>\<br>\<br>34&#x3001;&#x4ECE;&#x4ECA;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x5C06;&#x4E0D;&#x518D;&#x8D2A;&#x5403;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x7231;&#x5403;&#x800C;&#x5DF2;&#x3002;\<br>\<br>\<br>35&#x3001;&#x6211;&#x7684;&#x4F53;&#x91CD;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x3002;\<br>\<br>\<br>36&#x3001;&#x7231;&#x60C5;&#x5C31;&#x50CF;&#x7167;&#x7247;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x6697;&#x623F;&#x65F6;&#x95F4;&#x6765;&#x57F9;&#x517B;&#x3002;\<br>\<br>\<br>37&#x3001;&#x5E94;&#x8BE5;&#x6709;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x5F00;&#x59CB;&#x65B0;&#x4E00;&#x5929;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5343;&#x7BC7;&#x4E00;&#x5F8B;&#x5730;&#x5728;&#x6BCF;&#x4E2A;&#x4E0A;&#x5348;&#x90FD;&#x9192;&#x6765;&#x3002;\<br>\<br>\<br>38&#x3001;&#x52AA;&#x529B;&#x5DE5;&#x4F5C;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x6B7B;&#x4EA1;&#xFF01;&#x4E0D;&#x8FC7;&#x6211;&#x4E0D;&#x4F1A;&#x7528;&#x81EA;&#x5DF1;&#x53BB;&#x8BC1;&#x660E;&#x3002;\<br>\<br>\<br>39&#x3001;&#x518D;&#x5FEB;&#x4E50;&#x7684;&#x5355;&#x8EAB;&#x6C49;&#x8FDF;&#x65E9;&#x4E5F;&#x4F1A;&#x7ED3;&#x5A5A;,&#x5E78;&#x798F;&#x4E0D;&#x662F;&#x6C38;&#x4E45;&#x7684;&#x561B;&#x3002;\<br>\<br>\<br>40&#x3001;&#x806A;&#x660E;&#x4EBA;&#x90FD;&#x662F;&#x672A;&#x5A5A;&#x7684;,&#x7ED3;&#x5A5A;&#x7684;&#x4EBA;&#x5F88;&#x96BE;&#x518D;&#x806A;&#x660E;&#x8D77;&#x6765;&#x3002;\<br>\<br>\<br>41&#x3001;&#xFF08;&#x52A0;&#x83F2;&#x628A;&#x5634;&#x5F20;&#x5F97;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x5927;&#x7136;&#x540E;&#x7528;&#x5C3A;&#x5B50;&#x91CF;&#x5C3A;&#x5BF8;&#xFF09;&#x4E54;&#x6069;&#xFF0C;&#x6211;&#x7684;&#x751F;&#x65E5;&#x86CB;&#x7CD5;&#x8981;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x3002;\<br>\<br>\<br>42&#x3001;&#x4E54;&#x6069;&#xFF1A;&#x52A0;&#x83F2;&#x732B;&#xFF0C;&#x6211;&#x4E0D;&#x60F3;&#x8BF4;&#x4F60;&#x80D6;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x7684;&#x4E0B;&#x5DF4;&#x4E0A;&#x7684;&#x8936;&#x5FEB;&#x8D76;&#x4E0A;&#x4E00;&#x672C;&#x5B57;&#x5178;&#x4E86;&#x3002;\<br>\<br>\<br>43&#x3001;&#x4EBA;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x559C;&#x6B22;&#x73A9;&#x5177;&#x718A;&#x5462;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x4E2A;&#x6027;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x5403;&#x4F60;&#x7684;&#x4E1C;&#x897F;&#xFF0C;\<br>&#x4E0D;&#x4F1A;&#x548C;&#x4F60;&#x7EA6;&#x7684;&#x5973;&#x5B69;&#x8DF3;&#x821E;&#xFF0C;&#x4E0D;&#x4F1A;&#x62A2;&#x4F60;&#x7684;&#x98CE;&#x5934;&#x3002;\<br>\<br>\<br>\<br>\<br>\<br>44&#x3001;&#x4E54;&#x6069;&#xFF1A;&#x6293;&#x4F4F;&#x90A3;&#x53EA;&#x8001;&#x9F20;&#xFF0C;&#x6740;&#x4E86;&#x5B83;&#x3002;\<br>&#x52A0;&#x83F2;&#xFF1A;&#x6211;&#x662F;&#x53D7;&#x8FC7;&#x6559;&#x80B2;&#x7684;&#x732B;&#xFF0C;&#x624D;&#x4E0D;&#x5E72;&#x90A3;&#x79CD;&#x91CE;&#x86EE;&#x7684;&#x4E8B;&#x5462;&#x3002;\<br>\<br>\<br>45&#x3001;&#x4EBA;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x603B;&#x662F;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x5403;&#x8001;&#x9F20;&#x5462;&#xFF1F;&#x8FD9;&#x53EA;&#x8001;&#x9F20;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x7FA4;&#x5B69;&#x5B50;&#x7684;&#x6BCD;&#x4EB2;&#xFF0C;\<br>&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x8001;&#x9F20;&#x8BFE;&#x5802;&#x7684;&#x6559;&#x5E08;&#x2026;&#x2026;\<br>\<br>\<br>46&#x3001;&#x4E54;&#x6069;&#xFF1A;&#x52A0;&#x83F2;&#x732B;&#xFF0C;&#x6211;&#x4E0D;&#x60F3;&#x8BF4;&#x4F60;&#x80D6;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x8282;&#x98DF;&#x7684;&#x8BDD;&#xFF0C;&#x4E24;&#x4E2A;&#x53D1;&#x5C55;&#x4E2D;&#x56FD;&#x5BB6;&#x5C31;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7CAE;&#x98DF;&#x4E86;&#x3002;\<br>\<br>\<br>47&#x3001;&#x518D;&#x6CA1;&#x6709;&#x6BD4;&#x4E00;&#x8FB9;&#x559D;&#x70ED;&#x6C14;&#x817E;&#x817E;&#x7684;&#x5496;&#x5561;&#xFF0C;&#x4E00;&#x8FB9;&#x770B;&#x62A5;&#x7EB8;&#x66F4;&#x8212;&#x670D;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;\<br>&#x6211;&#x8981;&#x662F;&#x80FD;&#x770B;&#x61C2;&#x7684;&#x8BDD;&#x5C31;&#x66F4;&#x597D;&#x4E86;&#x3002;\<br>\<br>\<br>\<br>\<br>48&#x3001;&#x4E54;&#x6069;&#xFF1A;&#x52A0;&#x83F2;&#xFF0C;&#x4F60;&#x5728;&#x5C4B;&#x5B50;&#x91CC;&#x7684;&#x65F6;&#x95F4;&#x592A;&#x957F;&#x4E86;&#x3002;&#x6211;&#x600E;&#x4E48;&#x624D;&#x80FD;&#x4F7F;&#x4F60;&#x5BF9;&#x6237;&#x5916;&#x611F;&#x5174;&#x8DA3;&#x5462;&#xFF1F;\<br>&#x52A0;&#x83F2;&#xFF1A;&#x53EF;&#x4EE5;&#x628A;&#x4ED6;&#x642C;&#x5230;&#x5C4B;&#x5B50;&#x91CC;&#x6765;&#xFF0C;&#x90A3;&#x6837;&#x5C31;&#x884C;&#x4E86;&#x3002;\<br>\<br>\<br>49&#x3001;&#x4F60;&#x53EF;&#x4EE5;&#x6293;&#x6211;&#x7684;&#x6BDB;&#xFF0C;&#x53EF;&#x4EE5;&#x4FAE;&#x8FB1;&#x6211;&#x7684;&#x6BCD;&#x4EB2;&#xFF0C;&#x53EF;&#x4EE5;&#x63CD;&#x6211;&#x7684;&#x72D7;&#xFF0C;&#x53EF;&#x4EE5;&#x73A9;&#x6211;&#x7684;&#x6A61;&#x76AE;&#x8001;&#x9F20;&#xFF0C;\<br>&#x4F46;&#x662F;&#x4F60;&#x4E0D;&#x8BB8;&#x5403;&#x6211;&#x7684;&#x98DF;&#x7269;&#xFF0C;&#x4E0D;&#x8BB8;&#x5728;&#x6211;&#x7684;&#x5E8A;&#x4E0A;&#x7761;&#x89C9;&#xFF01;\<br>\<br>50&#x3001;&#x4E54;&#x6069;&#xFF1A;&#x52A0;&#x83F2;&#x732B;&#xFF0C;&#x4F60;&#x7684;&#x70E6;&#x607C;&#x662F;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x8BA4;&#x4E3A;&#x4F60;&#x662F;&#x4EBA;&#x7C7B;&#x3002;\<br>\<br>\<br>&#x52A0;&#x83F2;&#xFF1A;&#x4F60;&#x8BF4;&#x5BF9;&#x4E86;&#xFF01;&#x6211;&#x5F97;&#x60F3;&#x529E;&#x6CD5;&#x514B;&#x670D;&#x8FD9;&#x79CD;&#x81EA;&#x5351;&#x611F;&#x624D;&#x884C;&#x3002;\<br>\<br>\<br>51&#x3001;&#x4E54;&#x6069;&#xFF1A;&#x52A0;&#x83F2;&#x732B;&#xFF0C;&#x7B49;&#x7B49;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7684;&#x8718;&#x86DB;&#x662F;&#x65E0;&#x5BB3;&#x7684;&#x3002;\<br>&#x52A0;&#x83F2;&#xFF1A;&#x4F60;&#x8BF4;&#x7684;&#x5BF9;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x6B7B;&#x4E86;&#x7684;&#x90A3;&#x4E00;&#x79CD;&#x3002;\<br>\<br>\<br>52&#x3001;&#x4E54;&#x6069;&#xFF0C;&#x5FEB;&#x5E26;&#x6211;&#x770B;&#x517D;&#x533B;&#xFF01;&#x6211;&#x6709;&#x5931;&#x7720;&#x7684;&#x6BDB;&#x75C5;&#xFF0C;&#x6BCF;&#x8FC7;12&#x6216;&#x8005;13&#x5C0F;&#x65F6;&#xFF0C;&#x6211;&#x5C31;&#x9192;&#x4E86;</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/专业技术-印象笔记/">专业技术(印象笔记)</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/从印象笔记导入/">从印象笔记导入</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	  <div data-url="http://www.huguiqi.com/2016/03/30/加菲猫生活歪理/" data-title="加菲猫生活歪理 | 小黑的技术博客" data-tsina="1601653200" class="share clearfix">
	  </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2016/03/30/在IDEA下远程调试JavaScript/" title="在IDEA下远程调试JavaScript">
  <strong>上一篇：</strong><br/>
  <span>
  在IDEA下远程调试JavaScript</span>
</a>
</div>


<div class="next">
<a href="/2016/03/30/大数据时代笔记/"  title="大数据时代笔记">
 <strong>下一篇：</strong><br/> 
 <span>大数据时代笔记
</span>
</a>
</div>

</nav>

	
<section id="comments" class="comment">
	<div class="ds-thread" data-thread-key="2016/03/30/加菲猫生活歪理/" data-title="加菲猫生活歪理" data-url="http://www.huguiqi.com/2016/03/30/加菲猫生活歪理/"></div>
</section>


<section id="comments" class="comment">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>

</div>  
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#加菲猫生活歪理"><span class="toc-number">1.</span> <span class="toc-text">加菲猫生活歪理</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="github-card">
<p class="asidetitle">Github 名片</p>
<div class="github-card" data-github="huguiqi" data-width="220" data-height="119" data-theme="medium">
<script type="text/javascript" src="//cdn.jsdelivr.net/github-cards/latest/widget.js" ></script>
</div>
  </div>



  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/Alcatraz/" title="Alcatraz">Alcatraz<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/docker/" title="docker">docker<sup>4</sup></a></li>
		  
		
		  
			<li><a href="/categories/git/" title="git">git<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/github-博客/" title="github 博客">github 博客<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/hexo插件/" title="hexo插件">hexo插件<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/ios-Developer/" title="ios Developer">ios Developer<sup>5</sup></a></li>
		  
		
		  
			<li><a href="/categories/javascript/" title="javascript">javascript<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/nodejs/" title="nodejs">nodejs<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/专业技术-印象笔记/" title="专业技术(印象笔记)">专业技术(印象笔记)<sup>222</sup></a></li>
		  
		
		  
			<li><a href="/categories/前端技术/" title="前端技术">前端技术<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/感悟/" title="感悟">感悟<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/杂谈/" title="杂谈">杂谈<sup>5</sup></a></li>
		  
		
		  
			<li><a href="/categories/站内搜索-博客/" title="站内搜索 博客">站内搜索 博客<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/管理/" title="管理">管理<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/系统-工具/" title="系统&amp;工具">系统&amp;工具<sup>6</sup></a></li>
		  
		
		  
			<li><a href="/categories/系统-运维/" title="系统&amp;运维">系统&amp;运维<sup>11</sup></a></li>
		  
		
		  
			<li><a href="/categories/网络配置/" title="网络配置">网络配置<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>4</sup></a></li>
		  
		
		  
			<li><a href="/categories/面试题/" title="面试题">面试题<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/从印象笔记导入/" title="从印象笔记导入">从印象笔记导入<sup>222</sup></a></li>
			
		
			
				<li><a href="/tags/随笔/" title="随笔">随笔<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/ios-developer-upload/" title="ios developer upload">ios developer upload<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/docker-国内镜像/" title="docker 国内镜像">docker 国内镜像<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/javascript-原型编程/" title="javascript&amp;原型编程">javascript&amp;原型编程<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/ReactNative/" title="ReactNative">ReactNative<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/ios-developer-证书过期/" title="ios developer 证书过期">ios developer 证书过期<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/ios-developer-上传审核/" title="ios developer 上传审核">ios developer 上传审核<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/webStorm破解/" title="webStorm破解">webStorm破解<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/docker升级/" title="docker升级">docker升级<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/安装svn/" title="安装svn">安装svn<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/路由转发端口到内网服务器/" title="路由转发端口到内网服务器">路由转发端口到内网服务器<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitlabe-ce/" title="gitlabe-ce">gitlabe-ce<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/3DTouch-sample/" title="3DTouch sample">3DTouch sample<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/iptables与docker的作死碰撞/" title="iptables与docker的作死碰撞">iptables与docker的作死碰撞<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/nginx/" title="nginx">nginx<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/express-异常处理/" title="express 异常处理">express 异常处理<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/PM2/" title="PM2">PM2<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/面试题-全栈/" title="面试题 全栈">面试题 全栈<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/oh-my-zsh-vim-macos/" title="oh-my-zsh vim macos">oh-my-zsh vim macos<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://godeggs.cn " target="_blank" title="承接手机app、微信、web开发">找人做软件</a>
            
          </li>
        
          <li>
            
            	<a href="http://blog.huguiqi.com." target="_blank" title="sam&#39;s Blog">sam&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  

<div class="doubanshow">
<p class="asidetitle">豆瓣秀</p>
<div>
<script type="text/javascript" src="http://www.douban.com/service/badge/64698454/?show=collection&amp;n=12&amp;columns=3&amp;hidelogo=yes&amp;hideself=yes&amp;cat=book|movie" ></script>
</div>
</div>


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

  <div class="weiboshow">
  <p class="asidetitle">新浪微博</p>
    <iframe width="100%" height="119" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=119&fansRow=2&ptype=1&speed=0&skin=9&isTitle=1&noborder=1&isWeibo=0&isFans=0&uid=1601653200&verifier=bd864c6a&dpc=1"></iframe>
</div>


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Sam.This is my Blog. <br/>
			Anything that can go wrong will go wrong</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/1601653200" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/huguiqi" target="_blank" class="icon-github" title="github"></a>
		
		
		
		<a href="https://twitter.com/XiaoheiSpring" target="_blank" class="icon-twitter" title="twitter"></a>
		
		
		<a href="https://www.facebook.com/sam.hu.7334" target="_blank" class="icon-facebook" title="facebook"></a>
		
		
		<a href="https://www.linkedin.com/in/小黑-胡-ab83b992" target="_blank" class="icon-linkedin" title="linkedin"></a>
		
		
		<a href="https://www.douban.com/people/64698454" target="_blank" class="icon-douban" title="豆瓣"></a>
		
		
		<a href="http://www.zhihu.com/people/hu-xiao-hei-53" target="_blank" class="icon-zhihu" title="知乎"></a>
		
		
		<a href="https://plus.google.com/109318125124422212783?rel=author" target="_blank" class="icon-google_plus" title="Google+"></a>
		
		
		<a href="mailto:guiqi.hu@163.com" target="_blank" class="icon-email" title="Email Me"></a>
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="http://blog.huguiqi.com." target="_blank" title="sam">sam</a> © 2017 
		
		<a href="/about" target="_blank" title="sam hu">sam hu</a>
		
		
		</p>
</div>

 <script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
  (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
  e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');
  
  _st('install','qtnHgvQyg5N9h4en-9wA','2.0.0');
</script>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina'),
      description = $this.attr('description');
  var html = [
  '<div class="hoverqrcode clearfix"></div>',
  '<a class="overlay" id="qrcode"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="微信"></a>',
  '<a href="http://widget.renren.com/dialog/share?resourceUrl=' + encodedUrl + '&srcUrl=' + encodedUrl + '&title=' + title +'" class="article-share-renren" target="_blank" title="人人"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="微博"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);

  $('.hoverqrcode').hide();

  var myWidth = 0;
  function updatehoverqrcode(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
    var qrsize = myWidth > 1024 ? 200:100;
    var options = {render: 'image', size: qrsize, fill: '#2ca6cb', text: url, radius: 0.5, quiet: 1};
    var p = $('.article-share-qrcode').position();
    $('.hoverqrcode').empty().css('width', qrsize).css('height', qrsize)
                          .css('left', p.left-qrsize/2+20).css('top', p.top-qrsize-10)
                          .qrcode(options);
  };
  $(window).resize(function(){
    $('.hoverqrcode').hide();
  });
  $('.article-share-qrcode').click(function(){
    updatehoverqrcode();
    $('.hoverqrcode').toggle();
  });
  $('.article-share-qrcode').hover(function(){}, function(){
      $('.hoverqrcode').hide();
  });
});   
</script>



<script type="text/javascript">
  var duoshuoQuery = {short_name:"小黑_spring"};
  (function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0] 
    || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
</script> 


<script type="text/javascript">

var disqus_shortname = 'huguiqicom';

(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
</script>






<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->



<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?f5971877c7b77f98074be3ddabf34fbe";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>



<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
