
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>每位开发人员都应铭记的10句编程谚语 | 小黑的技术博客</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="sam hu">
    
    <meta name="baidu-site-verification" content="zBj0BDqjSV" />
    
    <meta name="description" content="&amp;#x6BCF;&amp;#x4F4D;&amp;#x5F00;&amp;#x53D1;&amp;#x4EBA;&amp;#x5458;&amp;#x90FD;&amp;#x5E94;&amp;#x94ED;&amp;#x8BB0;&amp;#x7684;10&amp;#x53E5;&amp;#x7F16;&amp;#x7A0B;&amp;#x8C1A;&amp;#x8BED;&amp;#x6240;&amp;#x8C13;&amp;#x8C1A;&amp;#x8BED;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x7528;&amp;#x8A0">
<meta property="og:type" content="article">
<meta property="og:title" content="每位开发人员都应铭记的10句编程谚语">
<meta property="og:url" content="http://blog.huguiqi.com/2016/03/30/每位开发人员都应铭记的10句编程谚语/index.html">
<meta property="og:site_name" content="小黑的技术博客">
<meta property="og:description" content="&amp;#x6BCF;&amp;#x4F4D;&amp;#x5F00;&amp;#x53D1;&amp;#x4EBA;&amp;#x5458;&amp;#x90FD;&amp;#x5E94;&amp;#x94ED;&amp;#x8BB0;&amp;#x7684;10&amp;#x53E5;&amp;#x7F16;&amp;#x7A0B;&amp;#x8C1A;&amp;#x8BED;&amp;#x6240;&amp;#x8C13;&amp;#x8C1A;&amp;#x8BED;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x7528;&amp;#x8A0">
<meta property="og:updated_time" content="2016-03-30T09:08:53.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="每位开发人员都应铭记的10句编程谚语">
<meta name="twitter:description" content="&amp;#x6BCF;&amp;#x4F4D;&amp;#x5F00;&amp;#x53D1;&amp;#x4EBA;&amp;#x5458;&amp;#x90FD;&amp;#x5E94;&amp;#x94ED;&amp;#x8BB0;&amp;#x7684;10&amp;#x53E5;&amp;#x7F16;&amp;#x7A0B;&amp;#x8C1A;&amp;#x8BED;&amp;#x6240;&amp;#x8C13;&amp;#x8C1A;&amp;#x8BED;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x7528;&amp;#x8A0">
<meta name="twitter:creator" content="@XiaoheiSpring">
<link rel="publisher" href="109318125124422212783">

    
    <link rel="alternative" href="/atom.xml" title="小黑的技术博客" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="小黑的技术博客" title="小黑的技术博客"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="小黑的技术博客">小黑的技术博客</a></h1>
				<h2 class="blog-motto">技术分享与学习，聚沙成塔!</h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/about">关于</a></li>
					
					<li><a href="http://blog.huguiqi.com.">副站</a></li>
					<li>
 					
						<form class="search" action="/search/index.html" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="text" id="search" autocomplete="on" class="st-default-search-input"  name="q" maxlength="30" placeholder="搜索" />
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/03/30/每位开发人员都应铭记的10句编程谚语/" title="每位开发人员都应铭记的10句编程谚语" itemprop="url">每位开发人员都应铭记的10句编程谚语</a>
  </h1>
  <p class="article-author">By
       
		<a href="https://plus.google.com/109318125124422212783?rel=author" title="sam hu" target="_blank" itemprop="author">sam hu</a>
		
  <p class="article-time">
    <time datetime="2016-03-30T09:08:53.000Z" itemprop="datePublished"> 发表于 2016-03-30</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#每位开发人员都应铭记的10句编程谚语"><span class="toc-number">1.</span> <span class="toc-text">每位开发人员都应铭记的10句编程谚语</span></a></li></ol>
		
		</div>
		
		<h1 id="&#x6BCF;&#x4F4D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x5E94;&#x94ED;&#x8BB0;&#x7684;10&#x53E5;&#x7F16;&#x7A0B;&#x8C1A;&#x8BED;"><a href="#&#x6BCF;&#x4F4D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x5E94;&#x94ED;&#x8BB0;&#x7684;10&#x53E5;&#x7F16;&#x7A0B;&#x8C1A;&#x8BED;" class="headerlink" title="&#x6BCF;&#x4F4D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x5E94;&#x94ED;&#x8BB0;&#x7684;10&#x53E5;&#x7F16;&#x7A0B;&#x8C1A;&#x8BED;"></a>&#x6BCF;&#x4F4D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x5E94;&#x94ED;&#x8BB0;&#x7684;10&#x53E5;&#x7F16;&#x7A0B;&#x8C1A;&#x8BED;</h1><p>&#x6240;&#x8C13;&#x8C1A;&#x8BED;&#xFF0C;&#x5C31;&#x662F;&#x7528;&#x8A00;&#x7B80;&#x610F;&#x8D45;&#x3001;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#x7684;&#x65B9;&#x5F0F;&#x4F20;&#x8FBE;&#x4EBA;&#x751F;&#x7BB4;&#x8A00;&#x548C;&#x666E;&#x904D;&#x771F;&#x7406;&#x7684;&#x8BDD;&#xFF0C;&#x5B83;&#x4EEC;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x5E2E;&#x52A9;&#x4F60;&#x5904;&#x7406;&#x751F;&#x6D3B;&#x548C;&#x5DE5;&#x4F5C;&#x4E0A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4E5F;&#x6B63;&#x56E0;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x624D;&#x6574;&#x7406;&#x4E86;10&#x53E5;&#x7F16;&#x7A0B;&#x8C1A;&#x8BED;&#xFF0C;&#x6BCF;&#x4F4D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x5E94;&#x8BE5;&#x94ED;&#x8BB0;&#x4ED6;&#x4EEC;&#xFF0C;&#x6B66;&#x88C5;&#x81EA;&#x5DF1;&#x3002;\<br>\<br> &#x3000;&#x3000;<strong>1. &#x65E0;&#x98CE;&#x4E0D;&#x8D77;&#x6D6A;</strong></p>
<div style="text-align: center;"><br><br>\<br>\<br><br><em>&#x522B;&#x7D27;&#x5F20;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BB8;&#x53EA;&#x662F;&#x4E00;&#x573A;&#x6D88;&#x9632;&#x6F14;&#x4E60;\
</em><br><br></div>

<p>\<br> &#x3000;&#x3000;&#x4EE3;&#x7801;&#x8BBE;&#x8BA1;&#x662F;&#x5426;&#x7CDF;&#x7CD5;&#xFF0C;&#x4ECE;&#x67D0;&#x4E9B;&#x5730;&#x65B9;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#x3002;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>a. &#x8D85;&#x5927;&#x7C7B;&#x6216;&#x8D85;&#x5927;&#x51FD;&#x6570;</li>
<li>b. &#x5927;&#x7247;&#x88AB;&#x6CE8;&#x91CA;&#x7684;&#x4EE3;&#x7801;</li>
<li>c. &#x903B;&#x8F91;&#x91CD;&#x590D;</li>
<li>d. If/else&#x5D4C;&#x5957;&#x8FC7;&#x6DF1;</li>
</ul>
<p>\<br> &#x3000;&#x3000;&#x7A0B;&#x5E8F;&#x5458;&#x4EEC;&#x901A;&#x5E38;&#x79F0;&#x5B83;&#x4EEC;&#x4F5C;&#x4EE3;&#x7801;&#x5F02;&#x5473;(Code<br>Smell)&#xFF0C;&#x4F46;&#x662F;&#x5C31;&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x201C;&#x4EE3;&#x7801;&#x8B66;&#x62A5;&#x201D;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x66F4;&#x4E3A;&#x5408;&#x9002;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x7D27;&#x8FEB;&#x611F;&#x7684;&#x542B;&#x4E49;&#x3002;&#x6839;&#x672C;&#x95EE;&#x9898;&#x5904;&#x7406;&#x4E0D;&#x5F53;&#xFF0C;&#x7EC8;&#x5C06;&#x5F15;&#x706B;&#x70E7;&#x8EAB;&#x3002;\<br>\<br> &#x3000;&#x3000;&#x8BD1;&#x6CE8;&#xFF1A;Code<br>Smell&#x4E2D;&#x6587;&#x8BD1;&#x540D;&#x4E00;&#x822C;&#x4E3A;&#x201C;&#x4EE3;&#x7801;&#x5F02;&#x5473;&#x201D;&#xFF0C;&#x6216;&#x201C;&#x4EE3;&#x7801;&#x5473;&#x9053;&#x201D;&#xFF0C;&#x5B83;&#x662F;&#x63D0;&#x793A;&#x4EE3;&#x7801;&#x4E2D;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x5B58;&#x5728;&#x9519;&#x8BEF;&#x7684;&#x4E00;&#x4E2A;&#x6697;&#x793A;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;smell&#xFF08;&#x5F02;&#x5473;&#xFF09;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x8FFD;&#x6355;&#x5230;&#x95EE;&#x9898;&#x3002;\<br>\<br>\<br> &#x3000;&#x3000;<strong>2. &#x9884;&#x9632;&#x4E3A;&#x4E3B;&#xFF0C;&#x6CBB;&#x7597;&#x4E3A;&#x8F85;</strong></p>
<div style="text-align: center;"><br><a id="more"></a><br><br><em>&#x76F8;&#x4FE1;&#x4E86;&#xFF01;\
</em><br><br></div>

<p>\</p>
<p>&#x3000;&#x3000;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#xFF0C;&#x4E30;&#x7530;&#x516C;&#x53F8;&#x7684;&#x6D41;&#x6C34;&#x4F5C;&#x4E1A;&#x7EBF;&#x56E0;&#x4E3A;&#x5B83;&#x5728;&#x7F3A;&#x9677;&#x9884;&#x9632;&#x65B9;&#x6CD5;&#x4E0A;&#x7684;&#x9769;&#x65B0;&#x53D8;&#x5F97;&#x51FA;&#x4E86;&#x540D;&#x7684;&#x9AD8;&#x6548;&#x3002;&#x6BCF;&#x4E2A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x90E8;&#x95E8;&#x6709;&#x95EE;&#x9898;&#x7684;&#x6210;&#x5458;&#x90FD;&#x6709;&#x6743;&#x6682;&#x505C;&#x751F;&#x4EA7;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x610F;&#x5728;&#x5B81;&#x53EF;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x540E;&#x9A6C;&#x4E0A;&#x6682;&#x5B9A;&#x751F;&#x4EA7;&#x3001;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x7531;&#x5176;&#x7EE7;&#x7EED;&#x751F;&#x4EA7;&#x800C;&#x5BFC;&#x81F4;&#x66F4;&#x68D8;&#x624B;&#x4E14;&#x66F4;&#x9AD8;&#x4EE3;&#x4EF7;&#x7684;&#x4FEE;&#x590D;/&#x66F4;&#x6362;/&#x53EC;&#x56DE;&#x540E;&#x7684;&#x95EE;&#x9898;&#x3002;\<br>\</p>
<p>&#x3000;&#x3000;&#x7A0B;&#x5E8F;&#x5458;&#x603B;&#x4F1A;&#x505A;&#x51FA;&#x751F;&#x4EA7;&#x7387;&#x5C31;&#x7B49;&#x540C;&#x4E8E;&#x5FEB;&#x901F;&#x7F16;&#x7801;&#x7684;&#x9519;&#x8BEF;&#x81C6;&#x65AD;&#x3002;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x4F1A;&#x4E0D;&#x5047;&#x601D;&#x7D22;&#x5730;&#x76F4;&#x63A5;&#x7740;&#x624B;&#x4EE3;&#x7801;&#x8BBE;&#x8BA1;&#x3002;&#x53EF;&#x60DC;&#xFF0C;&#x8FD9;&#x79CD;Leeroy<br>Jenkins&#x5F0F;&#x9C81;&#x83BD;&#x7684;&#x505A;&#x6CD5;&#x591A;&#x4F1A;&#x5BFC;&#x81F4;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x53D8;&#x5F97;&#x5F88;&#x908B;&#x9062;&#xFF0C;&#x62D9;&#x52A3;&#x7684;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x76D1;&#x6D4B;&#x548C;&#x4FEE;&#x6539;&#x2014;&#x2014;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5F7B;&#x5E95;&#x5730;&#x66FF;&#x6362;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x751F;&#x4EA7;&#x7387;&#x6240;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x56E0;&#x7D20;&#x5C31;<br>&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5199;&#x4EE3;&#x7801;&#x6240;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x8FD8;&#x8981;&#x6709;&#x8C03;&#x8BD5;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x7A0D;&#x4E0D;&#x7559;&#x795E;&#x5C31;&#x4F1A;&#x201C;&#x6361;&#x4E86;&#x829D;&#x9EBB;&#x4E22;&#x4E86;&#x897F;&#x74DC;&#x201D;&#x3002;&#xFF08;&#x56E0;&#x5C0F;&#x5931;&#x5927;&#x3002;&#xFF09;\<br>\<br> &#x3000;&#x3000;&#x8BD1;&#x6CE8;&#xFF1A;Leeroy Jenkins<br>&#x884C;&#x4E3A;&#xFF1A;WOW&#x6E38;&#x620F;&#x4E2D;&#x4E00;&#x4F4D;&#x73A9;&#x5BB6;&#x4E0D;&#x987E;&#x5927;&#x5BB6;&#x72EC;&#x8EAB;&#x4E00;&#x4EBA;&#x8FCE;&#x654C;&#xFF0C;&#x5BFC;&#x81F4;&#x706D;&#x56E2;&#x3002;\<br>\<br>\<br> &#x3000;&#x3000; <strong>3. &#x4E0D;&#x8981;&#x5B64;&#x6CE8;&#x4E00;&#x63B7;</strong> &#xFF08;&#x8FC7;&#x5EA6;&#x4F9D;&#x8D56;&#x67D0;&#x4EBA;&#xFF09;\<br>\<br> &#x3000;&#x3000;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x7684;&#x516C;&#x5171;&#x8981;&#x7D20;&#xFF08;bus<br>factor&#xFF09;&#x662F;&#x6307;&#x90A3;&#x4E9B;&#x4F1A;&#x5F71;&#x54CD;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x8FDB;&#x7A0B;&#x7684;&#x6838;&#x5FC3;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x603B;&#x6570;&#x3002;&#x6BD4;&#x5982;&#x67D0;&#x4EBA;&#x88AB;&#x8F66;&#x649E;&#x4E86;&#x6216;&#x67D0;&#x4EBA;&#x751F;&#x5B69;&#x5B50;&#x6216;&#x67D0;&#x4EBA;&#x8DF3;&#x69FD;&#x4E86;&#xFF0C;&#x9879;&#x76EE;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x65E0;&#x5E8F;&#xFF0C;&#x751A;&#x81F3;&#x4F1A;&#x6401;&#x7F6E;&#x3002;\<br>\<br> &#x3000;&#x3000;&#x8BD1;&#x6CE8;&#xFF1A; bus factor<br>&#x5373;&#x6307;&#x516C;&#x5171;&#x8981;&#x7D20;&#xFF0C;&#x6BD4;&#x55BB;&#x4E86;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5171;&#x540C;&#x56E0;&#x7D20;&#x3002;&#x5982;&#x679C;&#x6324;&#x4E0A; bus &#x7684; factor<br>&#x8D8A;&#x591A;&#xFF0C;bus &#x5C31;&#x8D8A;&#x4E0D;&#x7A33;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x63A7;&#x5236;&#x597D; bus factor &#xFF0C;&#x4EE5;&#x514D;&#x95EE;&#x9898;&#x53D1;&#x751F;&#x3002;\<br>\</p>
<p>&#x3000;&#x3000;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x7A81;&#x7136;&#x5931;&#x53BB;&#x4E86;&#x4E00;&#x4E2A;&#x4E3B;&#x529B;&#x6210;&#x5458;&#xFF0C;&#x4F60;&#x4F1A;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x751F;&#x610F;&#x4F9D;&#x65E7;&#x8FDB;&#x884C;&#x8FD8;&#x662F;&#x621B;&#x7136;&#x800C;&#x6B62;&#xFF1F;\<br>\</p>
<p>&#x3000;&#x3000;&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x8F6F;&#x4EF6;&#x56E2;&#x961F;&#x90FD;&#x9677;&#x5165;&#x4E86;&#x540E;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x4E9B;&#x56E2;&#x961F;&#x628A;&#x4ED6;&#x4EEC;&#x7684;&#x5F00;&#x53D1;&#x5458;&#x57F9;&#x517B;&#x6210;&#x4E86;&#x53EA;&#x4F1A;&#x5904;&#x7406;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x7684;&#x201C;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x201D;&#x3002;&#x8D77;&#x521D;&#xFF0C;&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5408;&#x7406;<br>&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5B83;<br>&#x5BF9;&#x6C7D;&#x8F66;&#x5236;&#x9020;&#x88C5;&#x914D;&#x751F;&#x4EA7;&#x7EBF;&#x5F88;&#x9002;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5BF9;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x5C31;&#x4E0D;&#x884C;&#x5462;&#xFF1F;&#x6BD5;&#x7ADF;&#xFF0C;&#x60F3;&#x8BA9;&#x6BCF;&#x4E2A;&#x6210;&#x5458;&#x90FD;&#x638C;&#x63E1;&#x6240;&#x7F16;&#x7A0B;&#x5E8F;&#x7684;&#x7EC6;&#x5FAE;&#x5DEE;&#x522B;&#x4E5F;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#xFF0C;&#x5BF9;&#x5427;&#xFF1F;\<br>\</p>
<p>&#x3000;&#x3000;&#x95EE;&#x9898;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x5BB9;&#x6613;&#x8F7B;&#x6613;&#x66FF;&#x6362;&#x6389;&#x3002;&#x867D;&#x7136;&#x5F53;&#x6BCF;&#x4F4D;&#x6210;&#x5458;&#x90FD;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x201C;&#x62BD;&#x5C49;&#x65B9;&#x6CD5;&#x201D;&#x5F88;&#x6709;&#x6548;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x5F53;&#x201C;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x201D;&#x7A81;&#x7136;&#x56E0;&#x4EBA;&#x4E8B;&#x53D8;&#x52A8;&#x3001;&#x75BE;&#x75C5;&#x6216;&#x7A81;&#x53D1;&#x4E8B;&#x6545;&#x800C;&#x65E0;&#x6CD5;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;<br>&#x62BD;&#x5C49;<br>&#x65B9;&#x6CD5;&#x7ACB;&#x9A6C;&#x571F;&#x5D29;&#x74E6;&#x89E3;&#x3002;&#xFF08;&#x6240;&#x4EE5;&#xFF0C;&#xFF09;&#x8F6F;&#x4EF6;&#x56E2;&#x961F;&#x6709;&#x4E00;&#x4E9B;&#x770B;&#x4F3C;&#x591A;&#x4F59;&#x5B9E;&#x5219;&#x91CD;&#x8981;&#x7684;&#x540E;&#x5907;&#x529B;&#x91CF;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x4EE3;&#x7801;&#x590D;&#x67E5;&#x3001;&#x7ED3;&#x5BF9;&#x7F16;&#x7A0B;&#x548C;&#x5171;&#x6709;&#x4EE3;&#x7801;&#x53EF;&#x7528;&#x6210;&#x529F;&#x8425;&#x9020;&#x4E00;&#x4E2A;&#x73AF;&#x5883;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;<br>&#x6BCF;&#x4F4D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x81F3;&#x5C11;&#x8868;&#x9762;&#x4E0A;&#x662F;&#x719F;&#x6089;&#x81EA;&#x5DF1;&#x975E;&#x64C5;&#x957F;&#x9886;&#x57DF;&#x4E4B;&#x5916;&#x7684;&#x7CFB;&#x7EDF;&#x90E8;&#x5206;&#x3002;\<br>\<br>\<br> &#x3000;&#x3000;<strong>4. &#x79CD;&#x74DC;&#x5F97;&#x74DC;&#xFF0C;&#x79CD;&#x8C46;&#x5F97;&#x8C46;</strong></p>
<div><br><br><a href="http://www.chinaz.com/upimg/userup/225009/22500ZF01010P00003E2.jpg" target="_blank" rel="external"></a>\<br>\<br><br></div>

<p>\</p>
<p>&#x3000;&#x3000;&#x300A;&#x6CE8;&#x91CD;&#x5B9E;&#x6548;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x6BB5;&#x8BDD;&#x89E3;&#x91CA;&#x201C;&#x7834;&#x7A97;&#x7406;&#x8BBA;&#x201D;&#xFF1A;&#x4E0D;&#x8981;&#x7559;&#x7740;&#x201C;&#x7834;&#x7A97;&#x6237;&#x201D;&#xFF08;&#x4F4E;&#x52A3;&#x7684;&#x8BBE;&#x8BA1;&#x3001;&#x9519;&#x8BEF;&#x7684;&#x51B3;&#x7B56;&#x6216;&#x8005;&#x7CDF;&#x7CD5;&#x7684;&#x4EE3;&#x7801;&#xFF09;&#x4E0D;&#x4FEE;&#x3002;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x5C31;&#x4FEE;&#x4E00;&#x4E2A;&#x3002;&#x5982;<br>&#x679C;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x4FEE;&#x7406;&#xFF0C;&#x5C31;&#x5148;&#x628A;&#x5B83;&#x4FDD;&#x7559;&#x8D77;&#x6765;&#x3002;&#x6216;&#x8BB8;&#x4F60;&#x53EF;<br>&#x4EE5;&#x628A;&#x51FA;&#x95EE;&#x9898;&#x7684;&#x4EE3;&#x7801;&#x653E;&#x5230;&#x6CE8;&#x91CA;&#x4E2D;&#xFF0C;&#x6216;&#x662F;&#x663E;&#x793A;&#x201C;&#x672A;&#x5B9E;&#x73B0;&#x201D;&#x6D88;&#x606F;&#xFF0C;&#x6216;&#x7528;&#x865A;&#x62DF;&#x6570;&#x636E;&#x52A0;&#x4EE5;&#x66FF;&#x4EE3;&#x3002;&#x91C7;&#x53D6;&#x4E00;&#x4E9B;&#x63AA;&#x65BD;&#xFF0C;&#x9632;&#x6B62;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x6076;&#x5316;&#x3002;&#x8FD9;&#x8868;&#x660E;&#x5C40;&#x52BF;&#x5C1A;&#x5728;&#x638C;&#x63A7;&#x4E4B;&#x4E2D;&#x3002;\<br>\</p>
<p>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x89C1;&#x8FC7;&#x6574;&#x6D01;&#x826F;&#x597D;&#x7684;&#x7CFB;&#x7EDF;&#x5728;&#x51FA;&#x73B0;&#x201C;&#x7834;&#x7A97;&#x201D;&#x4E4B;&#x540E;&#x7ACB;&#x9A6C;&#x5D29;&#x6E83;&#x3002;&#x867D;&#x7136;&#x4FC3;&#x4F7F;&#x8F6F;&#x4EF6;&#x5D29;&#x6E83;&#x7684;&#x539F;&#x56E0;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x56E0;&#x7D20;&#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x63A5;&#x89E6;&#x5230;&#xFF09;&#xFF0C;&#x4F46;&#xFF08;&#x5BF9;&#x201C;&#x7834;&#x7A97;&#x201D;&#xFF09;&#x7F6E;&#x4E4B;&#x4E0D;&#x7406;&#xFF0C;&#x80AF;&#x5B9A;&#x4F1A;&#x66F4;&#x5FEB;&#x5730;&#x52A0;&#x901F;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x3002;\<br>\</p>
<p>&#x3000;&#x3000;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x4FC3;&#x751F;&#x597D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x7CDF;&#x7CD5;&#x7684;&#x4EE3;&#x7801;&#x4E5F;&#x4F1A;&#x4FC3;&#x751F;&#x7CDF;&#x7CD5;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x522B;&#x4F4E;&#x4F30;&#x4E86;&#x60EF;&#x6027;&#x7684;&#x529B;&#x91CF;&#x3002;&#x6CA1;&#x4EBA;&#x60F3;&#x53BB;&#x6574;&#x7406;&#x7CDF;&#x7CD5;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x540C;&#x6837;&#x6CA1;&#x4EBA;&#x60F3;&#x628A;&#x5B8C;&#x7F8E;&#x7684;&#x4EE3;&#x7801;&#x5F04;&#x5F97;&#x4E00;&#x56E2;&#x7CDF;&#x3002;&#x5199;&#x597D;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x624D;&#x66F4;&#x53EF;&#x80FD;&#x7ECF;&#x5F97;&#x4F4F;&#x65F6;&#x95F4;&#x7684;&#x8003;&#x9A8C;&#x3002;\<br>\<br> &#x3000;&#x3000;&#x8BD1;&#x6CE8;&#xFF1A;&#x300A;&#x6CE8;&#x91CD;&#x5B9E;&#x6548;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x300B;&#xFF0C;&#x4F5C;&#x8005;Andrew Hunt / David<br>Thomas&#x3002;&#x8BE5;&#x4E66;&#x76F4;&#x51FB;&#x7F16;&#x7A0B;&#x9648;&#x5730;&#xFF0C;&#x7A7F;&#x8FC7;&#x4E86;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x65E5;&#x76CA;&#x589E;&#x957F;&#x7684;&#x89C4;&#x8303;&#x548C;&#x6280;&#x672F;&#x85E9;&#x7BF1;&#xFF0C;&#x5BF9;&#x6838;&#x5FC3;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x4E86;&#x5BA1;&#x89C6;&#x2015;&#x2015;&#x5373;&#x6839;&#x636E;&#x9700;&#x6C42;&#xFF0C;&#x521B;&#x5EFA;&#x7528;&#x6237;&#x4E50;&#x4E8E;&#x63A5;&#x53D7;&#x7684;&#x3001;&#x53EF;&#x5DE5;&#x4F5C;&#x548C;&#x6613;&#x7EF4;&#x62A4;<br>&#x7684;<br>&#x4EE3;&#x7801;&#x3002;&#x672C;&#x4E66;&#x5305;&#x542B;&#x7684;&#x5185;&#x5BB9;&#x4ECE;&#x4E2A;&#x4EBA;&#x8D23;&#x4EFB;&#x5230;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#xFF0C;&#x76F4;&#x81F3;&#x4FDD;&#x6301;&#x4EE3;&#x7801;&#x7075;&#x6D3B;&#x548C;&#x6613;&#x4E8E;&#x6539;&#x7F16;&#x91CD;&#x7528;&#x7684;&#x67B6;&#x6784;&#x6280;&#x672F;&#x3002;&#x4ECE;&#x672C;&#x4E66;&#x4E2D;&#x5C06;&#x5B66;&#x5230;&#x9632;&#x6B62;&#x8F6F;&#x4EF6;&#x53D8;&#x8D28;&#x3001;&#x6D88;&#x9664;&#x590D;&#x5236;&#x77E5;&#x8BC6;&#x7684;&#x9677;&#x9631;&#x3001;&#x7F16;&#x5199;&#x7075;&#x6D3B;&#x3001;&#x52A8;<br>&#x6001;&#x548C;&#x6613;&#x9002;&#x5E94;&#x7684;&#x4EE3;&#x7801;&#x3001;&#x907F;&#x514D;&#x51FA;&#x73B0;&#x76F8;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x3001;&#x7528;&#x5951;&#x7EA6;&#x3001;&#x65AD;&#x8A00;&#x548C;&#x5F02;&#x5E38;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x9632;&#x62A4;&#x7B49;&#x5185;&#x5BB9;&#x3002;\<br>\<br> &#x3000;&#x3000;&#x8BD1;&#x6CE8;&#xFF1A;&#x7834;&#x7A97;&#x7406;&#x8BBA;&#xFF08;Broken Window<br>theory&#xFF09;&#xFF1A;&#x662F;&#x5173;&#x4E8E;&#x73AF;&#x5883;&#x5BF9;&#x4EBA;&#x4EEC;&#x5FC3;&#x7406;&#x9020;&#x6210;&#x6697;&#x793A;&#x6027;&#x6216;&#x8BF1;&#x5BFC;&#x6027;&#x5F71;&#x54CD;&#x7684;&#x4E00;&#x79CD;&#x8BA4;&#x8BC6;&#x3002;&#x201C;&#x7834;&#x7A97;&#x6548;&#x5E94;&#x201D;&#x7406;&#x8BBA;&#x662F;&#x6307;&#xFF1A;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x6253;&#x574F;&#x4E86;&#x4E00;&#x5E62;&#x5EFA;&#x7B51;&#x7269;&#x7684;&#x7A97;&#x6237;&#x73BB;&#x7483;&#xFF0C;&#x800C;&#x8FD9;&#x6247;&#x7A97;&#x6237;&#x53C8;&#x5F97;&#x4E0D;<br>&#x5230;&#x53CA;&#x65F6;&#x7684;&#x7EF4;&#x4FEE;&#xFF0C;&#x522B;&#x4EBA;&#x5C31;&#x53EF;&#x80FD;&#x53D7;&#x5230;&#x67D0;&#x4E9B;&#x6697;&#x793A;&#x6027;&#x7684;&#x7EB5;&#x5BB9;&#x53BB;&#x6253;&#x70C2;&#x66F4;&#x591A;&#x7684;&#x7A97;&#x6237;&#x3002;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x5C31;&#x8981;&#x53CA;&#x65F6;&#x77EB;&#x6B63;&#x548C;&#x8865;&#x6551;&#x3002;\<br>\<br>\<br> &#x3000;&#x3000;<strong>5. &#x6B32;&#x901F;&#x5219;&#x4E0D;&#x8FBE;</strong>\<br>\</p>
<p>&#x3000;&#x3000;&#x7ECF;&#x7406;&#x3001;&#x5BA2;&#x6237;&#x548C;&#x7A0B;&#x5E8F;&#x5458;&#x6B63;&#x65E5;&#x76CA;&#x53D8;&#x5F97;&#x6025;&#x8E81;&#x3002;&#x4E00;&#x5207;&#x90FD;&#x9700;&#x8981;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x9A6C;&#x4E0A;&#x5C31;&#x505A;&#x597D;&#x3002;&#x6B63;&#x56E0;&#x5982;&#x6B64;&#xFF0C;&#x5FEB;&#x901F;&#x4FEE;&#x590D;&#x95EE;&#x9898;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x6025;&#x8FEB;&#x3002;\<br>\</p>
<p>&#x3000;&#x3000;&#x6CA1;&#x65F6;&#x95F4;&#x5BF9;&#x4E00;&#x4E2A;&#x65B0;&#x529F;&#x80FD;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF1F;&#x597D;&#x5427;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5148;&#x5B8C;&#x6210;&#x4E00;&#x6B21;&#x6D4B;&#x8BD5;&#x8FD0;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x56DE;&#x6765;&#x7EE7;&#x7EED;&#x6D4B;&#x8BD5;&#x5B83;&#x3002;\<br>\</p>
<p>&#x3000;&#x3000;&#x5F53;&#x8BBF;&#x95EE;Y&#x5C5E;&#x6027;&#x65F6;&#xFF0C;&#x4F1A;&#x4E0D;&#x4F1A;&#x78B0;&#x5230;&#x5947;&#x602A;&#x7684;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x9519;&#x8BEF;&#xFF1F;&#x65E0;&#x8BBA;&#x600E;&#x6837;&#xFF0C;&#x628A;&#x4EE3;&#x7801;&#x653E;&#x5230;try/catch&#x8BED;&#x53E5;&#x5757;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x9493;&#x5230;&#x5927;&#x9C7C;&#x5566;&#xFF01;\<br>\</p>
<p>&#x3000;&#x3000;&#x662F;&#x4E0D;&#x662F;&#x4F3C;&#x66FE;&#x76F8;&#x8BC6;&#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x4EE5;&#x524D;&#x5DF2;&#x7ECF;&#x90FD;&#x505A;&#x5230;&#x4E86;&#x3002;&#x5E76;&#x4E14;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x3001;&#x5B83;&#x662F;&#x65E0;&#x53EF;&#x975E;&#x8BAE;&#x7684;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x6700;&#x540E;&#x671F;&#x9650;&#xFF0C;&#x8FD8;&#x5F97;&#x6EE1;&#x8DB3;&#x5BA2;&#x6237;&#x548C;&#x7ECF;&#x7406;&#x3002;&#x4F46;&#x4E0D;&#x8981;&#x8FC7;&#x4E8E;&#x9891;&#x7E41;<br>&#x64CD;<br>&#x4F5C;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x7A33;&#x5B9A;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x70ED;&#x4FEE;&#x590D;&#x3001;&#x903B;&#x8F91;&#x91CD;&#x590D;&#x3001;&#x672A;&#x6D4B;&#x8BD5;&#x7684;&#x65B9;&#x6848;&#x548C;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x8981;&#x4E48;&#x662F;&#x628A;&#x4E8B;&#x60C5;&#x8349;&#x8349;&#x505A;&#x5B8C;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x628A;&#x4E8B;&#x60C5;&#x597D;&#x597D;&#x505A;&#x5B8C;&#x3002;\<br>\<br> &#x3000;&#x3000;<strong>6. &#x4E09;&#x601D;&#x800C;&#x540E;&#x884C;</strong>\<br>\</p>
<p>&#x3000;&#x3000;&#x201C;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x6700;&#x8FD1;&#x88AB;&#x9891;&#x7E41;&#x6EE5;&#x7528;&#xFF0C;&#x7ECF;&#x5E38;&#x88AB;&#x7A0B;&#x5E8F;&#x5458;&#x7528;&#x6765;&#x63A9;&#x9970;&#x4ED6;&#x4EEC;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x7CDF;&#x7CD5;&#x89C4;&#x5212;/&#x8BBE;&#x8BA1;&#x9636;&#x6BB5;&#x3002;&#x6211;&#x4EEC;&#x662F;&#x8BBE;&#x8BA1;&#x8005;&#xFF0C;&#x770B;&#x5230;&#x4EA7;&#x54C1;&#x671D;&#x6B63;&#x5F53;&#x65B9;&#x5411;&#x6709;&#x5B9E;&#x8D28;&#x8FDB;&#x5C55;&#xFF0C;<br>&#x6211;&#x4EEC;&#x7406;&#x5E94;&#x9AD8;&#x5174;&#x3002;&#x4F46;&#x610F;&#x5916;&#x7684;&#x662F;&#xFF0C;UML&#x56FE;&#x548C;&#x7528;&#x4F8B;&#x5206;&#x6790;&#x4F3C;&#x4E4E;&#x5E76;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x6211;&#x4EEC;&#x7684;&#x613F;&#x671B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x4E0D;&#x77E5;&#x81EA;&#x5DF1;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6216;&#x8005;&#x4E0D;&#x77E5;&#x81EA;&#x5DF1;&#x8EAB;&#x5904;&#x4F55;&#x5904;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7ECF;&#x5E38;&#x5C31;&#x7A00;<br>&#x91CC;&#x7CCA;&#x6D82;&#x5730;&#x5199;&#x4EE3;&#x7801;&#x4E86;&#x3002;\<br>\</p>
<p>&#x3000;&#x3000;&#x8FD9;&#x5C31;&#x597D;&#x6BD4;&#x4F60;&#x8981;&#x53BB;&#x5403;&#x996D;&#xFF0C;&#x4F46;&#x4F60;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x60F3;&#x597D;&#x53BB;&#x54EA;&#x91CC;&#x5403;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x592A;&#x997F;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x5730;&#x627E;&#x4E2A;&#x9910;&#x9986;&#xFF0C;&#x5B9A;&#x4E2A;&#x684C;&#x4F4D;&#x3002;&#x7136;&#x540E;&#x4F60;&#x4E0A;&#x8F66;&#x5F00;&#x8F66;&#x540E;&#x6CBF;&#x9014;&#x5728;&#x60F3;&#xFF08;&#x627E;&#x5730;&#x65B9;&#x5403;&#x996D;&#xFF09;&#x3002;&#x53EA;<br>&#x662F;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x8017;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x8981;&#x8FC7;&#x8F83;&#x591A;&#x7684;U&#x578B;&#x5F2F;&#x9053;&#xFF0C;&#x8FD8;&#x5728;&#x9910;&#x9986;&#x524D;&#x505C;&#x8F66;&#xFF0C;&#x4E5F;&#x8BB8;&#x6700;&#x540E;&#x56E0;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#x8FC7;&#x957F;&#x800C;&#x4E0D;&#x5403;&#x4E86;&#x3002;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x4F60;&#x6700;&#x540E;&#x5E94;&#x8BE5;&#x80FD;&#x627E;&#x5230;&#x5730;&#x65B9;&#x5403;&#x996D;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x80FD;<br>&#x5403;&#x7684;&#x996D;&#x5E76;&#x4E0D;&#x662F;&#x4F60;&#x60F3;&#x5403;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x6837;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x80FD;&#x6BD4;&#x4F60;&#x76F4;&#x63A5;&#x5728;&#x60F3;&#x53BB;&#x7684;&#x9910;&#x9986;&#x8BA2;&#x9910;&#x6240;&#x82B1;&#x7684;&#x65F6;&#x95F4;&#x66F4;&#x957F;&#x3002;\<br>\<br>\<br> &#x3000;&#x3000;<strong>7. &#x5982;&#x679C;&#x4F60;&#x60DF;&#x4E00;&#x7684;&#x5DE5;&#x5177;&#x662F;&#x4E00;&#x628A;&#x9524;&#x5B50;&#xFF0C;&#x4F60;&#x5F80;&#x5F80;&#x4F1A;&#x628A;&#x4E00;&#x5207;&#x95EE;&#x9898;&#x770B;&#x6210;&#x9489;&#x5B50;</strong></p>
<div style="text-align: center;"><br><br>\<br><em>&#x770B;&#x89C1;&#x4E86;&#x5427;&#xFF1F;&#x6211;&#x65E9;&#x5C31;&#x8BF4;&#x8FC7;&#x52A8;&#x6001;&#x8BB0;&#x5F55;&#x5728;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x5F88;&#x6709;&#x6548;\
</em><br><br></div>

<p>\</p>
<p>&#x3000;&#x3000;&#x7A0B;&#x5E8F;&#x5458;&#x6709;&#x4E00;&#x79CD;&#x503E;&#x5411;&#xFF0C;&#x5F53;&#x4E00;&#x8C08;&#x5230;&#x4ED6;&#x4EEC;&#x5DE5;&#x5177;&#x65F6;&#xFF0C;&#x5176;&#x89C6;&#x91CE;&#x5C31;&#x53D8;&#x72ED;&#x7A84;&#x4E86;&#x3002;&#x4E00;&#x65E6;&#x67D0;&#x79CD;&#x65B9;&#x6CD5;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E0A;&#x201C;&#x884C;&#x5F97;&#x901A;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x6240;&#x6709;&#x7684;&#x9879;&#x76EE;&#x4E0A;&#x90FD;&#x7528;&#x5230;&#x5B83;&#x3002;&#x5B66;&#x4E60;<br>&#x65B0;&#x4E1C;<br>&#x897F;&#x4EFF;&#x4F5B;&#x662F;&#x4E00;&#x79CD;&#x714E;&#x71AC;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x751A;&#x81F3;&#x4F1A;&#x5FC3;&#x795E;&#x4E0D;&#x5B9A;&#x3002;&#x4ECE;&#x59CB;&#x81F3;&#x7EC8;&#x90FD;&#x5728;&#x60F3;&#x201C;&#x5982;&#x679C;&#x6211;&#x7528;&#x4E4B;&#x524D;&#x7684;&#x65B9;&#x6CD5;&#x505A;&#x3001;&#x8FD9;&#x4E2A;&#x5C31;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x9EBB;&#x70E6;&#x4E86;&#x201D;&#x3002;&#x4E00;&#x5B9A;&#x8981;&#x6452;&#x5F03;&#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#xFF0C;&#x6309;&#x6211;&#x4EEC;&#x6240;&#x77E5;&#x9053;&#x7684;&#x53BB;&#x505A;&#xFF0C;&#x5373;<br>&#x4F7F;&#x90A3;&#x4E0D;&#x662F;&#x6700;&#x5B8C;&#x7F8E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x3002;\<br>\</p>
<p>&#x3000;&#x3000;&#x575A;&#x6301;&#x81EA;&#x5DF1;&#x6240;&#x77E5;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ECE;&#x957F;&#x8FDC;&#x7684;&#x89D2;&#x5EA6;&#x8BB2;&#xFF0C;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x9002;&#x5408;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x7684;&#x5DE5;&#x5177;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x5C31;&#x4F1A;&#x4E0E;&#x4F60;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x683C;&#x683C;&#x4E0D;&#x5165;&#x3002;\<br>\<br>\<br> &#x3000;&#x3000;<strong>8. &#x6C89;&#x9ED8;&#x5373;&#x8D5E;&#x540C;</strong></p>
<div style="text-align: center;"><br><br><em>\<br>\
</em><br><br></div>

<p>\<br> &#x3000;&#x3000;&#x201C;&#x7834;&#x7A97;&#x7406;&#x8BBA;&#x201D;&#x4E0E;&#x201D;&#x53D8;&#x6210;&#x60EF;&#x6027;&#x7406;&#x8BBA;&#x201D;&#x6709;&#x7740;&#x5B8F;&#x89C2;&#x7684;&#x8054;&#x7CFB;&#x3002;\<br>\</p>
<p>&#x3000;&#x3000;&#x7F16;&#x7A0B;&#x793E;&#x533A;&#x5C31;&#x597D;&#x50CF;&#x4E00;&#x4E2A;&#x73B0;&#x5B9E;&#x793E;&#x533A;&#x3002;&#x6BCF;&#x4E2A;&#x4F5C;&#x54C1;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x7F29;&#x5F71;&#x3002;&#x7CDF;&#x7CD5;&#x7684;&#x4EE3;&#x7801;&#x53D1;&#x5E03;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x5C31;&#x8D8A;&#x5BB9;&#x6613;&#x53CD;&#x6620;&#x73B0;&#x72B6;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x53BB;&#x52AA;&#x529B;&#x7F16;&#x5199;&#x4F18;&#x79C0;&#x3001;&#x6574;&#x6D01;&#x548C;&#x7A33;&#x5B9A;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x4F60;&#x6BCF;&#x5929;&#x90FD;&#x5C06;&#x548C;&#x7CDF;&#x7CD5;&#x7684;&#x4EE3;&#x7801;&#x76F8;&#x4F34;&#x4E86;&#x3002;\<br>\</p>
<p>&#x3000;&#x3000;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x770B;&#x5230;&#x522B;&#x4EBA;&#x5199;&#x51FA;&#x4E86;&#x7CDF;&#x7CD5;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x5C31;&#x8981;&#x8DDF;&#x8FD9;&#x4E2A;&#x4EBA;&#x63D0;&#x51FA;&#x6765;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x673A;&#x667A;&#x5C31;&#x5E94;&#x8BE5;&#x7528;&#x4E0A;&#x573A;&#x4E86;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x613F;&#x610F;&#x627F;&#x8BA4;&#x4ED6;&#x4EEC;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x8FD8;&#x662F;&#x6709;&#x4E0D;&#x61C2;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x611F;&#x8C22;&#x4F60;&#x7684;&#x597D;&#x610F;&#x3002;&#x4E92;&#x76F8;&#x5E2E;&#x52A9;&#x5BF9;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x5229;&#xFF0C;&#x800C;&#x5BF9;&#x95EE;&#x9898;&#x89C6;&#x800C;&#x4E0D;&#x89C1;&#xFF0C;&#x53EA;&#x4F1A;&#x4F7F;&#x95EE;&#x9898;&#x4E00;&#x76F4;&#x5B58;&#x5728;&#x3002;\<br>\<br>\<br> &#x3000;&#x3000;<strong>9. &#x53CC;&#x9E1F;&#x5728;&#x6797;&#xFF0C;&#x4E0D;&#x5982;&#x4E00;&#x9E1F;&#x5728;&#x624B;</strong>\<br>\</p>
<p>&#x3000;&#x3000;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x8BA8;&#x8BBA;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x548C;&#x91CD;&#x6784;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5DEE;&#x627E;&#x4E2A;&#x65F6;&#x95F4;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x5B8C;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x6B63;&#x5E38;&#x8FD0;&#x4F5C;&#x7684;&#x4E1C;&#x897F;&#x66F4;&#x52A0;&#x7B80;&#x6D01;&#x800C;&#x505A;&#x6539;&#x52A8;&#xFF0C;&#x6743;&#x8861;&#x6539;&#x52A8;&#x7684;&#x5229;&#x5F0A;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x7B80;&#x6D01;&#x662F;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x76EE;<br>&#x6807;&#xFF0C;<br>&#x4F46;&#x603B;&#x4F1A;&#x6709;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x91CD;&#x6784;&#x6539;&#x8FDB;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5728;&#x7F16;&#x7A0B;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x4EE3;&#x7801;&#x4E0D;&#x8FC7;&#x65F6;&#xFF0C;&#x4F1A;&#x9891;&#x7E41;&#x7B80;&#x5355;&#x6539;&#x52A8;&#x4EE3;&#x7801;&#x3002;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x4F60;&#x53C8;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x4EE3;&#x7801;&#x5BF9;&#x5BA2;&#x6237;&#x6709;&#x4EF7;&#x503C;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4F60;&#x9762;&#x4E34;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7A98;<br>&#x5883;&#xFF1A;&#x4F60;&#x4E0D;&#x80FD;&#x4E00;&#x77F3;&#x4E8C;&#x9E1F;&#x3002;&#x4F60;&#x5728;&#x91CD;&#x6784;&#x65E7;&#x4EE3;&#x7801;&#x4E0A;&#x6240;&#x53D1;&#x65F6;&#x95F4;&#x8D8A;&#x591A;&#xFF0C;&#x4F60;&#x7F16;&#x5199;&#x65B0;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x8D8A;&#x5C11;&#x3002;&#x5728;&#x53CA;&#x65F6;&#x6539;&#x8FDB;&#x4EE3;&#x7801;&#x548C;&#x7EF4;&#x62A4;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x627E;&#x5230;&#x5E73;&#x8861;&#x70B9;&#x3002;\<br>\<br> &#x3000;&#x3000;<strong>10. &#x80FD;&#x529B;&#x8D8A;&#x5927;&#xFF0C;&#x8D23;&#x4EFB;&#x8D8A;&#x5927;</strong></p>
<div><br><br><a href="http://www.chinaz.com/upimg/userup/225009/22500ZF01010P000024b.jpg" target="_blank" rel="external"></a>  \<br>\<br><br></div>

<p>\</p>
<p>&#x3000;&#x3000;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x8F6F;&#x4EF6;&#x5DF2;&#x6210;&#x4E3A;&#x6211;&#x4EEC;&#x751F;&#x6D3B;&#x4E2D;&#x4E00;&#x4E2A;&#x65E2;&#x57FA;&#x672C;&#x53C8;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x6B63;&#x56E0;&#x5982;&#x6B64;&#xFF0C;&#x5F00;&#x53D1;&#x4F18;&#x79C0;&#x8F6F;&#x4EF6;&#x683C;&#x5916;&#x91CD;&#x8981;&#x3002;&#x4E52;&#x4E53;&#x7403;&#x6E38;&#x620F;&#x4E2D;&#x7684;Bug&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#xFF0C;&#x822A;&#x5929;&#x98DE;&#x673A;&#x5BFC;&#x5411;&#x7CFB;&#x7EDF;&#x6216;&#x8005;&#x822A;<br>&#x7A7A;&#x4EA4;&#x901A;&#x7BA1;&#x5236;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;Bug&#x662F;&#x53E6;&#x5916;&#x4E00;&#x56DE;&#x4E8B;&#x3002;Slashdot&#x66FE;&#x53D1;&#x8868;&#x4E00;&#x6587;&#xFF0C;&#x8BB2;&#x8FF0;&#x4E86;&#x5355;&#x5355;Google<br>News&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x5931;&#x8BEF;&#x4F7F;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x80A1;&#x7968;&#x84B8;&#x53D1;11.4&#x4EBF;&#x7F8E;&#x5143;&#x3002;&#x5176;&#x4ED6;&#x4F8B;&#x5B50;&#x53C2;&#x89C1;&#x300A;<a href="http://www.jobbole.com/entry.php/97" target="_blank" rel="external">&#x8F6F;&#x4EF6;Bug&#x5F15;&#x53D1;&#x7684;&#x5341;&#x6B21;&#x4E25;&#x91CD;&#x540E;&#x679C;</a>&#x300B;&#x3002;&#x8FD9;&#x4E9B;&#x4F8B;&#x5B50;&#x4FBF;&#x8BF4;&#x660E;&#x4E86;&#x6211;&#x4EEC;&#x6B63;&#x884C;&#x4F7F;&#x7740;&#x591A;&#x5927;&#x7684;&#x6743;&#x5229;&#x3002;&#x4F60;&#x4ECA;&#x5929;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x662F;&#x5426;&#x6709;&#x610F;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x6709;&#x671D;&#x4E00;&#x65E5;&#x5728;&#x91CD;&#x8981;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x6D3E;&#x4E0A;&#x7528;&#x573A;&#xFF0C;&#x8FD9;&#x60F3;&#x60F3;&#x90FD;&#x4EE4;&#x4EBA;&#x5BB3;&#x6015;&#x3002;&#x7F16;&#x5199;&#x6B63;&#x786E;&#x5408;&#x683C;&#x7684;&#x4EE3;&#x7801;&#x5427;&#xFF01;</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/专业技术-印象笔记/">专业技术(印象笔记)</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/从印象笔记导入/">从印象笔记导入</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	  <div data-url="http://blog.huguiqi.com/2016/03/30/每位开发人员都应铭记的10句编程谚语/" data-title="每位开发人员都应铭记的10句编程谚语 | 小黑的技术博客" data-tsina="1601653200" class="share clearfix">
	  </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2016/03/30/CocoaPods 的一些略为高级一丁点的使用/" title="CocoaPods 的一些略为高级一丁点的使用">
  <strong>上一篇：</strong><br/>
  <span>
  CocoaPods 的一些略为高级一丁点的使用</span>
</a>
</div>


<div class="next">
<a href="/2016/03/30/申请企业证书需要的资料/"  title="申请企业证书需要的资料">
 <strong>下一篇：</strong><br/> 
 <span>申请企业证书需要的资料
</span>
</a>
</div>

</nav>

	
<section id="comments" class="comment">
	<div class="ds-thread" data-thread-key="2016/03/30/每位开发人员都应铭记的10句编程谚语/" data-title="每位开发人员都应铭记的10句编程谚语" data-url="http://blog.huguiqi.com/2016/03/30/每位开发人员都应铭记的10句编程谚语/"></div>
</section>


<section id="comments" class="comment">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>

</div>  
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#每位开发人员都应铭记的10句编程谚语"><span class="toc-number">1.</span> <span class="toc-text">每位开发人员都应铭记的10句编程谚语</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="github-card">
<p class="asidetitle">Github 名片</p>
<div class="github-card" data-github="huguiqi" data-width="220" data-height="119" data-theme="medium">
<script type="text/javascript" src="//cdn.jsdelivr.net/github-cards/latest/widget.js" ></script>
</div>
  </div>



  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/Alcatraz/" title="Alcatraz">Alcatraz<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/docker/" title="docker">docker<sup>4</sup></a></li>
		  
		
		  
			<li><a href="/categories/git/" title="git">git<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/github-博客/" title="github 博客">github 博客<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/hexo插件/" title="hexo插件">hexo插件<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/ios-Developer/" title="ios Developer">ios Developer<sup>5</sup></a></li>
		  
		
		  
			<li><a href="/categories/javascript/" title="javascript">javascript<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/nodejs/" title="nodejs">nodejs<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/专业技术-印象笔记/" title="专业技术(印象笔记)">专业技术(印象笔记)<sup>222</sup></a></li>
		  
		
		  
			<li><a href="/categories/感悟/" title="感悟">感悟<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/杂谈/" title="杂谈">杂谈<sup>3</sup></a></li>
		  
		
		  
		
		  
			<li><a href="/categories/站内搜索-博客/" title="站内搜索 博客">站内搜索 博客<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/管理/" title="管理">管理<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/系统-工具/" title="系统&amp;工具">系统&amp;工具<sup>6</sup></a></li>
		  
		
		  
			<li><a href="/categories/系统-运维/" title="系统&amp;运维">系统&amp;运维<sup>11</sup></a></li>
		  
		
		  
			<li><a href="/categories/网络配置/" title="网络配置">网络配置<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>4</sup></a></li>
		  
		
		  
			<li><a href="/categories/面试题/" title="面试题">面试题<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/从印象笔记导入/" title="从印象笔记导入">从印象笔记导入<sup>222</sup></a></li>
			
		
			
				<li><a href="/tags/随笔/" title="随笔">随笔<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/ios-developer-upload/" title="ios developer upload">ios developer upload<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/docker-国内镜像/" title="docker 国内镜像">docker 国内镜像<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/javascript-原型编程/" title="javascript&amp;原型编程">javascript&amp;原型编程<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/阿里云/" title="阿里云">阿里云<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/3DTouch-sample/" title="3DTouch sample">3DTouch sample<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/ios-developer-上传审核/" title="ios developer 上传审核">ios developer 上传审核<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/docker升级/" title="docker升级">docker升级<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/面试题-全栈/" title="面试题 全栈">面试题 全栈<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/安装svn/" title="安装svn">安装svn<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitlabe-ce/" title="gitlabe-ce">gitlabe-ce<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/macbook显卡门/" title="macbook显卡门">macbook显卡门<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/iptables与docker的作死碰撞/" title="iptables与docker的作死碰撞">iptables与docker的作死碰撞<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/nginx/" title="nginx">nginx<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/express-异常处理/" title="express 异常处理">express 异常处理<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/oh-my-zsh-vim-macos/" title="oh-my-zsh vim macos">oh-my-zsh vim macos<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/PM2/" title="PM2">PM2<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/svn与git/" title="svn与git">svn与git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/三体/" title="三体">三体<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://godeggs.cn " target="_blank" title="承接手机app、微信、web开发">找人做软件</a>
            
          </li>
        
          <li>
            
            	<a href="http://blog.huguiqi.com." target="_blank" title="sam&#39;s Blog">sam&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  

<div class="doubanshow">
<p class="asidetitle">豆瓣秀</p>
<div>
<script type="text/javascript" src="http://www.douban.com/service/badge/64698454/?show=collection&amp;n=12&amp;columns=3&amp;hidelogo=yes&amp;hideself=yes&amp;cat=book|movie" ></script>
</div>
</div>


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

  <div class="weiboshow">
  <p class="asidetitle">新浪微博</p>
    <iframe width="100%" height="119" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=119&fansRow=2&ptype=1&speed=0&skin=9&isTitle=1&noborder=1&isWeibo=0&isFans=0&uid=1601653200&verifier=bd864c6a&dpc=1"></iframe>
</div>


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Sam.This is my Blog. <br/>
			Anything that can go wrong will go wrong</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/1601653200" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/huguiqi" target="_blank" class="icon-github" title="github"></a>
		
		
		
		<a href="https://twitter.com/XiaoheiSpring" target="_blank" class="icon-twitter" title="twitter"></a>
		
		
		<a href="https://www.facebook.com/sam.hu.7334" target="_blank" class="icon-facebook" title="facebook"></a>
		
		
		<a href="https://www.linkedin.com/in/小黑-胡-ab83b992" target="_blank" class="icon-linkedin" title="linkedin"></a>
		
		
		<a href="https://www.douban.com/people/64698454" target="_blank" class="icon-douban" title="豆瓣"></a>
		
		
		<a href="http://www.zhihu.com/people/hu-xiao-hei-53" target="_blank" class="icon-zhihu" title="知乎"></a>
		
		
		<a href="https://plus.google.com/109318125124422212783?rel=author" target="_blank" class="icon-google_plus" title="Google+"></a>
		
		
		<a href="mailto:guiqi.hu@163.com" target="_blank" class="icon-email" title="Email Me"></a>
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="http://blog.huguiqi.com." target="_blank" title="sam">sam</a> © 2017 
		
		<a href="/about" target="_blank" title="sam hu">sam hu</a>
		
		
		</p>
</div>

 <script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
  (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
  e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');
  
  _st('install','qtnHgvQyg5N9h4en-9wA','2.0.0');
</script>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina'),
      description = $this.attr('description');
  var html = [
  '<div class="hoverqrcode clearfix"></div>',
  '<a class="overlay" id="qrcode"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="微信"></a>',
  '<a href="http://widget.renren.com/dialog/share?resourceUrl=' + encodedUrl + '&srcUrl=' + encodedUrl + '&title=' + title +'" class="article-share-renren" target="_blank" title="人人"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="微博"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);

  $('.hoverqrcode').hide();

  var myWidth = 0;
  function updatehoverqrcode(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
    var qrsize = myWidth > 1024 ? 200:100;
    var options = {render: 'image', size: qrsize, fill: '#2ca6cb', text: url, radius: 0.5, quiet: 1};
    var p = $('.article-share-qrcode').position();
    $('.hoverqrcode').empty().css('width', qrsize).css('height', qrsize)
                          .css('left', p.left-qrsize/2+20).css('top', p.top-qrsize-10)
                          .qrcode(options);
  };
  $(window).resize(function(){
    $('.hoverqrcode').hide();
  });
  $('.article-share-qrcode').click(function(){
    updatehoverqrcode();
    $('.hoverqrcode').toggle();
  });
  $('.article-share-qrcode').hover(function(){}, function(){
      $('.hoverqrcode').hide();
  });
});   
</script>



<script type="text/javascript">
  var duoshuoQuery = {short_name:"小黑_spring"};
  (function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0] 
    || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
</script> 


<script type="text/javascript">

var disqus_shortname = 'huguiqicom';

(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
</script>






<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->



<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?f5971877c7b77f98074be3ddabf34fbe";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>



<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
